In [773]:
from IPython.display import display, HTML
from datetime import datetime

# Notebook title
Notebook_title = "Back to Basics"

# Current date
current_date = datetime.now().strftime("%B %d, %Y")

# Create the HTML string with title, date, and author
html_content = f"""
<h1 style="text-align:center;">{Notebook_title}: Python</h1>
<br/>
<h3 style="text-align:left;">MikiasHWT</h3>
<h3 style="text-align:left;">{current_date}</h3>
"""

# Display the HTML content in the output
display(HTML(html_content))

# Prep Workplace

In [774]:
import numpy as np
print("Numpy version:", np.__version__)
# help(np)

# To show multiple lines in output
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

Numpy version: 2.1.2

In [775]:
######################## Git/venv/Python Good practices: ########################
# Save package requirements as txt file using pip freeze. 
# Exclude .venv from git repo (i will choose to include it in .gitignore for now)
# Include session_info.show() at end of scripts

# pip freeze > requirements.txt (to save)
# pip install -r requirements.txt (to install)
# pip install session_info

# Data Types

## Primitive data-types
Int, Float, Bool, String

### Integer

In [776]:
# Integer
type(-12)

int

### Double

In [777]:
# Double
type(12.5)

float

### Complex

In [778]:
# Complex
type(3j)

complex

### Boolean

In [779]:
# Boolean
type(False)
type(True)
type("False")
type("True")

bool

bool

str

str

### String

In [780]:
String1='First String' # Single quotes
String2="Second String" # Double quotes

In [781]:
# Strings
type(String1) 
type(String2)

str

str

In [782]:
# Repeat
String1*2

'First StringFirst String'

In [783]:
# Index
String1[0]

'F'

In [784]:
# Slice
String1[:3]

'Fir'

In [785]:
# Range Slice
String1[0:5]

'First'

In [786]:
# Concatenate
String1 + " & " + String2

'First String & Second String'

In [787]:
# Slice and concatenate
String1[0:5] + " & " + String2[0:6]

'First & Second'

In [788]:
# Proper capitalization
str.capitalize('string')

'String'

In [789]:
# Length
len(String1)

12

In [790]:
# Determine if digits
String1.isdigit()

False

In [791]:
String3="12345"
String3.isdigit()

True

In [792]:
# Strings are immutable, but new string can be made from combinations
String4= String1.replace('First', String3)
String1
String3
String4

'First String'

'12345'

'12345 String'

In [793]:
# to search for a substring within a string and return the index of the first occurrence of the substring. 
# If the substring is not found, it returns -1.
String1.find(String3)

-1

In [794]:
# Value of String3 is found starting at index [0] of String 4
String4.find(String3)

0

In [795]:
# Value of String 5 is found starting at index [6] of String 4
String5="String"
String4.find(String5)

6

In [796]:
# Data type conversion 

# TypeError: can only concatenate str (not "int") to str

# x = 2
# y = "Part "
# combo = (y) + (x)
# combo

In [797]:
# Data type conversion
x = 2
y = "Part "
combo = (y) + str(x)
combo

'Part 2'

In [798]:
# Tripple quotes
multiline="""
Multiline text
between tripple quotes 
is also
an acceptable 
string type
"""

In [799]:
multiline

'\nMultiline text\nbetween tripple quotes \nis also\nan acceptable \nstring type\n'

In [800]:
type(multiline)

str

## Non-Primitive
List, Array, Tuple, Set, Dictionary, Stacks, Queue, Graphs, Trees, Files

### Lists
- An ordered, mutable collection of items, 
  - e.g., [1, 2, 3, "apple"]

In [801]:
# Lists
num_list=[1,2,3]

In [802]:
type(num_list)

list

In [803]:
char_list=["First Name", "Middle Name", "Last Name"]

In [804]:
type(char_list)

list

In [805]:
mix_list=["First", 10, 3j, ["Internal", "List"], "Last", 20, ]

In [806]:
type(mix_list)

list

In [807]:
# Lists can be indexed (and nested)
mix_list[3]

['Internal', 'List']

In [808]:
# Lists can be appended
mix_list.append("New Addition")

In [809]:
mix_list

['First', 10, 3j, ['Internal', 'List'], 'Last', 20, 'New Addition']

In [810]:
# Lists can be edited
mix_list[5]=200000

In [811]:
mix_list

['First', 10, 3j, ['Internal', 'List'], 'Last', 200000, 'New Addition']

### Array
-Not used often
-Similar to lists, with some differences. 
-Require specific module (import array as arr)

- common type codes used with array:

    - 'b': Signed char (1 byte)
    - 'B': Unsigned char (1 byte)
    - 'u': Unicode character (2 or 4 bytes, depending on the platform)
    - 'h': Signed short (2 bytes)
    - 'H': Unsigned short (2 bytes)
    - 'i': Signed int (2 or 4 bytes)
    - 'I': Unsigned int (2 or 4 bytes)
    - 'l': Signed long (4 bytes)
    - 'L': Unsigned long (4 bytes)
    - 'f': Float (4 bytes)
    - 'd': Double (8 bytes)

In [812]:
import array as arr

# datatype inside array [] requires specification with a code. 
a = arr.array("I",[3,6,9])
type(a)

array.array

In [813]:
# Define the array of Unicode characters
array_char = arr.array("u", ["c", "a", "t", "s"])

array_char

# index
array_char[1]

array('u', 'cats')

'a'

In [814]:
# Use tounicode() method to convert to a string
array_string = array_char.tounicode()

# Print the array as a string
print(array_string)  # Output: 'cats'

cats

In [815]:
# Numpy Arrays
np.array([1, 2, 44, 5, 6])

array([ 1,  2, 44,  5,  6])

In [816]:
# Specify data type
np.array([1, 2, 3], dtype = str)

array(['1', '2', '3'], dtype='<U1')

In [817]:
# multidimensional array
np.array([range(i, i+10) for i in [0, 5, 10]])

# Produces vectors as follows range(0, 10), range(5, 15), range(10, 20)

array([[ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9],
       [ 5,  6,  7,  8,  9, 10, 11, 12, 13, 14],
       [10, 11, 12, 13, 14, 15, 16, 17, 18, 19]])

In [818]:
# Create a length-10 integer array filled with zeros
np.zeros(10, dtype=int)

array([0, 0, 0, 0, 0, 0, 0, 0, 0, 0])

In [819]:
# Create 3x5 array with floating-point arrays filled with ones
np.ones((3, 5), dtype=float)

array([[1., 1., 1., 1., 1.],
       [1., 1., 1., 1., 1.],
       [1., 1., 1., 1., 1.]])

In [820]:
# Create a 3x5 array filled with 3.14
np.full((3,5), 3.14)

array([[3.14, 3.14, 3.14, 3.14, 3.14],
       [3.14, 3.14, 3.14, 3.14, 3.14],
       [3.14, 3.14, 3.14, 3.14, 3.14]])

In [821]:
# Create an array filled with a linear sequence 
np.arange(0, 20, 2)

array([ 0,  2,  4,  6,  8, 10, 12, 14, 16, 18])

In [822]:
# Create an array filled with 5 values evenly spaced between 0 and 3
np.linspace(0, 3, 5)

array([0.  , 0.75, 1.5 , 2.25, 3.  ])

In [823]:
# Create a 3x3 array of uniformly distributed random values between 0 and 1
np.random.random((3, 3))

array([[0.66252687, 0.01357164, 0.6228461 ],
       [0.67365963, 0.971945  , 0.87819347],
       [0.50962438, 0.05571469, 0.45115921]])

In [824]:
# Create a 3x3 array of normally distributed random values with mean 0 and SD 1
np.random.normal(0, 1, (3, 3))

array([[-0.04411241, -0.36326702, -0.01234481],
       [ 0.04212149,  1.95929589, -0.1984257 ],
       [ 0.33053441, -1.43582841,  0.02752832]])

In [825]:
# create a 3x3 array of random integers in the interval of [0, 10]
np.random.randint(0, 10, (3, 3))

array([[9, 1, 4],
       [6, 8, 2],
       [3, 0, 0]], dtype=int32)

In [826]:
# Create a 3x3 identity matrix 
np.eye(3)

array([[1., 0., 0.],
       [0., 1., 0.],
       [0., 0., 1.]])

In [827]:
# Array attributes
np.random.seed(0)  # seed for reproducibility

x1 = np.random.randint(10, size=6)  # One-dimensional array
x2 = np.random.randint(10, size=(3, 4))  # Two-dimensional array
x3 = np.random.randint(10, size=(3, 4, 5))  # Three-dimensional array

In [828]:
print("x3 ndim: ", x3.ndim)
print("x3 shape:", x3.shape)
print("x3 size: ", x3.size)
print("dtype:", x3.dtype)
print("itemsize:", x3.itemsize, "bytes") # size in bytes of each element
print("nbytes:", x3.nbytes, "bytes") # total size in bytes of the array
# nbytes = itemsize x size

x3 ndim:  3
x3 shape: (3, 4, 5)
x3 size:  60
dtype: int32
itemsize: 4 bytes
nbytes: 240 bytes

In [829]:
# Aggregating on arrays
M = np.random.random((3, 4))
print(M)

[[0.65279032 0.63505887 0.99529957 0.58185033]
 [0.41436859 0.4746975  0.6235101  0.33800761]
 [0.67475232 0.31720174 0.77834548 0.94957105]]

In [830]:
# Numpy defaults to aggregating the entire array
M.sum()

np.float64(7.435453494015987)

In [831]:
# Specify min value per column
M.min(axis=0)

array([0.41436859, 0.31720174, 0.6235101 , 0.33800761])

In [832]:
# Specify min value per row
M.min(axis=1)

array([0.58185033, 0.33800761, 0.31720174])

The ``axis`` keyword specifies the *dimension of the array that will be collapsed*, rather than the dimension that will be returned.
So specifying ``axis=0`` means that the first axis will be collapsed: for two-dimensional arrays, this means that values within each column will be aggregated.

#### Other aggregation functions

Most aggregates have a ``NaN``-safe counterpart that computes the result while ignoring missing values,


|Function Name      |   NaN-safe Version  | Description                                   |
|-------------------|---------------------|-----------------------------------------------|
| ``np.sum``        | ``np.nansum``       | Compute sum of elements                       |
| ``np.prod``       | ``np.nanprod``      | Compute product of elements                   |
| ``np.mean``       | ``np.nanmean``      | Compute mean of elements                      |
| ``np.std``        | ``np.nanstd``       | Compute standard deviation                    |
| ``np.var``        | ``np.nanvar``       | Compute variance                              |
| ``np.min``        | ``np.nanmin``       | Find minimum value                            |
| ``np.max``        | ``np.nanmax``       | Find maximum value                            |
| ``np.argmin``     | ``np.nanargmin``    | Find index of minimum value                   |
| ``np.argmax``     | ``np.nanargmax``    | Find index of maximum value                   |
| ``np.median``     | ``np.nanmedian``    | Compute median of elements                    |
| ``np.percentile`` | ``np.nanpercentile``| Compute rank-based statistics of elements     |
| ``np.any``        | N/A                 | Evaluate whether any elements are true        |
| ``np.all``        | N/A                 | Evaluate whether all elements are true        |

#### Boolean Arrays and masks

when you write ``x < 3``, internally NumPy uses ``np.less(x, 3)``.
    A summary of the comparison operators and their equivalent ufunc is shown here:

| Operator	    | Equivalent ufunc    | 
|---------------|---------------------| 
|``==``         |``np.equal``         | 
|``<``          |``np.less``          | 
|``>``          |``np.greater``       | 
|``!=``         |``np.not_equal``     |
|``<=``         |``np.less_equal``    |
|``>=``         |``np.greater_equal`` |

In [833]:
rng = np.random.RandomState(0)
x = rng.randint(10, size=(3, 4))
x

array([[5, 0, 3, 3],
       [7, 9, 3, 5],
       [2, 4, 7, 6]], dtype=int32)

In [834]:
# Boolean array mask
x < 6

array([[ True,  True,  True,  True],
       [False, False,  True,  True],
       [ True,  True, False, False]])

In [835]:
# how many values less than 6?
np.count_nonzero(x < 6)

8

In [836]:
# Equivalent 
np.sum(x < 6)

np.int64(8)

In [837]:
# Benefits of sum(): it can be performed across rows or columns
# How many values less than 6 in each row
np.sum(x < 6, axis=1)

array([4, 2, 2])

In [838]:
# are there any values greater than 8?
np.any(x > 8)

np.True_

In [839]:
# are there all values equal to 6?
np.all(x == 6)

np.False_

In [840]:
# are all values in each row less than 8?
np.all(x < 8, axis=1)

array([ True, False,  True])

Warning: Python has built-in ``sum()``, ``any()``, and ``all()`` functions. These have a different syntax than the NumPy versions, and in particular will fail or produce unintended results when used on multidimensional arrays. Use ``np.sum()``, ``np.any()``, and ``np.all()`` for mutlidimensional arrays.

In [841]:
# Select values that return True (as 1-D array)
x[x < 5]

array([0, 3, 3, 3, 2, 4], dtype=int32)

The difference between the keywords ``and`` and ``or``, and the operators ``&`` and ``|`` is this:

 ``and`` and ``or`` gauge the truth or falsehood of *entire object*
 
 while ``&`` and ``|`` refer to *bits within each object*.

When you use ``and`` or ``or``, it's equivalent to asking Python to treat the object as a single Boolean entity.
In Python, all nonzero integers will evaluate as True. Thus:

In [842]:
bool(42), bool(0)

(True, False)

In [843]:
bool(42 and 0)

False

In [844]:
bool(42 or 0)

True

when using ``&`` and ``|`` on integers, the expression operates on the bits of the element, applying the *and* or the *or* to the individual bits making up the number:

In [845]:
bin(42)

'0b101010'

In [846]:
bin(59)

'0b111011'

In [847]:
bin(42 & 59)

'0b101010'

In [848]:
bin(42 | 59)

'0b111011'

When you have an array of Boolean values in NumPy, this can be thought of as a string of bits where ``1 = True`` and ``0 = False``, and the result of ``&`` and ``|`` operates similarly to above:

In [849]:
A = np.array([1, 0, 1, 0, 1, 0], dtype=bool)
B = np.array([1, 1, 1, 0, 1, 1], dtype=bool)
A | B

array([ True,  True,  True, False,  True,  True])

Using ``or`` on these arrays will try to evaluate the truth or falsehood of the entire array object, which is not a well-defined value:

In [850]:
# A or B 
# ValueError: The truth value of an array with more than one element is ambiguous. Use a.any() or a.all()

Similarly, when doing a Boolean expression on a given array, you should use ``|`` or ``&`` rather than ``or`` or ``and``:

In [851]:
x = np.arange(10)
(x > 4) & (x < 8)

array([False, False, False, False, False,  True,  True,  True, False,
       False])

In [852]:
# (x > 4) and (x < 8)
# ValueError: The truth value of an array with more than one element is ambiguous. Use a.any() or a.all()

#### Boolean bitwise logic operators

| Operator	    | Equivalent ufunc    |
|---------------|---------------------|
|``&``          |``np.bitwise_and``   |
|``^``          |``np.bitwise_xor``   |
|&#124;         |``np.bitwise_or``    |
|``~``          |``np.bitwise_not``   |

#### Sorting Arrays

In [853]:
# returning a sorted version of an array without modifying the input
x = np.array([2, 1, 3, 5, 4])
np.sort(x)
x

array([1, 2, 3, 4, 5])

array([2, 1, 3, 5, 4])

In [854]:
# sort an array in place 
x.sort()
x

array([1, 2, 3, 4, 5])

In [855]:
# return indices of sorted elements
x = np.array([2, 1, 3, 5, 4])
i = np.argsort(x)
i

# fancy indexing to can then be used to return sorted array
x[i]

array([1, 0, 2, 4, 3])

array([1, 2, 3, 4, 5])

In [856]:
rand = np.random.RandomState(42)
X = rand.randint(0, 10, (4, 6))
print(X)

[[6 3 7 4 6 9]
 [2 6 7 4 3 7]
 [7 2 5 4 1 7]
 [5 1 4 0 9 5]]

In [857]:
# sort each column of X
np.sort(X, axis=0)

array([[2, 1, 4, 0, 1, 5],
       [5, 2, 5, 4, 3, 7],
       [6, 3, 7, 4, 6, 7],
       [7, 6, 7, 4, 9, 9]], dtype=int32)

In [858]:
# sort each row of X
np.sort(X, axis=1)

array([[3, 4, 6, 6, 7, 9],
       [2, 3, 4, 6, 7, 7],
       [1, 2, 4, 5, 7, 7],
       [0, 1, 4, 5, 5, 9]], dtype=int32)

In [859]:
# Partial sorting: Partitioning 
x = np.array([7, 2, 3, 1, 6, 5, 4])
np.partition(x, 3)

array([1, 2, 3, 4, 5, 6, 7])

 ``np.partition`` takes an array and a number *K*; the result is a new array with the smallest *K* values to the left of the partition, and the remaining values to the right, in arbitrary order:

#### Structured Arrays

In [860]:
# use compound data types for structured arrays
data = np.zeros(4, dtype={'names':('name', 'age', 'weight'), 
                          'formats':('U10', 'i4', 'f8')})

print(data.dtype)

[('name', '<U10'), ('age', '<i4'), ('weight', '<f8')]

``'U10'`` = "Unicode string of maximum length 10," 

``'i4'`` = "4-byte (i.e., 32 bit) integer," 

``'f8'`` = "8-byte (i.e., 64 bit) float."

In [861]:
# define data values
name = ['Alice', 'Bob', 'Cathy', 'Doug']
age = [25, 45, 37, 19]
weight = [55.0, 85.5, 68.0, 61.5]

In [862]:
# fill structured data array
data['name'] = name
data['age'] = age
data['weight'] = weight
print(data)

[('Alice', 25, 55. ) ('Bob', 45, 85.5) ('Cathy', 37, 68. )
 ('Doug', 19, 61.5)]

In [863]:
# Get all names
data['name']

array(['Alice', 'Bob', 'Cathy', 'Doug'], dtype='<U10')

In [864]:
# Get first row of data
data[0]

np.void(('Alice', 25, 55.0), dtype=[('name', '<U10'), ('age', '<i4'), ('weight', '<f8')])

### Tuples
- An ordered, immutable collection of items, 
  - e.g., (1, 2, 3, "apple")

In [865]:
# Tuples
tpl =(1,2,3,3,4,5,5)

In [866]:
type(tpl)

tuple

In [867]:
# Tuple can be indexed
tpl[2]

3

In [868]:
# Tuples cannot be modified

# TypeError: 'tuple' object does not support item assignment

# tpl[2]=12

In [869]:
# Tuples cannot be appended

# AttributeError: 'tuple' object has no attribute 'append'

# tpl.append("12")

### Sets
- An unordered, mutable collection of unique items, 
  - e.g., {1, 2, 3}

In [870]:
# Sets
a_set={44,1,3,3,2,44}

In [871]:
type(a_set)

set

In [872]:
# Sets dont output duplicate elements
a_set

{1, 2, 3, 44}

In [873]:
# Sets cannot be indexed

# TypeError: 'set' object is not subscriptable

# a_set[3]

In [874]:
# Sets cannot be modified 

# TypeError: 'set' object does not support item assignment

# a_set[3]=126

In [875]:
# Sets cannot be appended

# AttributeError: 'set' object has no attribute 'append'

# a_set.append(5)

In [876]:
# Use case: sets
set1={1,25,4,57,6,7,7,83,22}
set2={7,6,1,65,78,23,84,22}

In [877]:
# UNION: all unique elements from both sets
set1 | set2

{1, 4, 6, 7, 22, 23, 25, 57, 65, 78, 83, 84}

In [878]:
# INTERSECTION: only the elements that are common to both sets
set1 & set2

{1, 6, 7, 22}

In [879]:
# DIFFERENCE: the elements that are in set1 but not in set2
set1 -  set2

{4, 25, 57, 83}

In [880]:
# SYMMETRIC DIFFERENCE: elements that are in either set1 or set2 but not in both
set1 ^ set2

{4, 23, 25, 57, 65, 78, 83, 84}

In [881]:
# SUBSET: Checks if all elements of one set are contained in another set. (includes the possibility that they are the same sets)
set1 <= set2
set1.issubset(set2)

False

False

In [882]:
# PROPER SUBSET: Checks if one set is a strict subset of another (but the sets are not equal).
set1 < set2  # True if set1 is a proper subset of set2.

False

In [883]:
# SUPERSET: Checks if one set contains all elements of another set. (includes the possibility that they are the same sets)
set1 >= set2
set1.issuperset(set2)

False

False

In [884]:
# PROPER SUPERSET: Checks if one set is a strict superset of another (but the sets are not equal).
set1 > set2  # True if set1 is a proper superset of set2.

False

In [885]:
# DISJOING SET: Checks if two sets have no elements in common
set1.isdisjoint(set2) # Returns True if set1 and set2 have no elements in common.

False

### Dictionary
- A collection of key-value pairs, 
  - e.g., {"name": "Alice", "age": 25}.

In [886]:
# Dictionary : require key-value pair
dict={"First Name":"Mikias", "Username":"MikiasHWT", "Birthplace":"Eritrea", "Favorite Food":["Tsebhi", "Shiro", "Qulwa", "Pizza"]}

In [887]:
dict

{'First Name': 'Mikias',
 'Username': 'MikiasHWT',
 'Birthplace': 'Eritrea',
 'Favorite Food': ['Tsebhi', 'Shiro', 'Qulwa', 'Pizza']}

In [888]:
type(dict)

dict

In [889]:
# Dictionary keys can be called
dict.keys()

dict_keys(['First Name', 'Username', 'Birthplace', 'Favorite Food'])

In [890]:
# Dictionary values can be called
dict.values()

dict_values(['Mikias', 'MikiasHWT', 'Eritrea', ['Tsebhi', 'Shiro', 'Qulwa', 'Pizza']])

In [891]:
# Dictionary items (combination of key,value) can be called
dict.items()

dict_items([('First Name', 'Mikias'), ('Username', 'MikiasHWT'), ('Birthplace', 'Eritrea'), ('Favorite Food', ['Tsebhi', 'Shiro', 'Qulwa', 'Pizza'])])

In [892]:
# Values can be indexed by specifying key
dict["First Name"]

'Mikias'

In [893]:
# Specific values can be modified
dict["Birthplace"] = "Asmara, Eritrea"

In [894]:
dict

{'First Name': 'Mikias',
 'Username': 'MikiasHWT',
 'Birthplace': 'Asmara, Eritrea',
 'Favorite Food': ['Tsebhi', 'Shiro', 'Qulwa', 'Pizza']}

In [895]:
# Dict can be further modified and appended (without deleting existing key:values)
dict.update({'First Name': 'Mikias',
 'Birthplace': 'Asmara, Eritrea aka: The Motherland',
 'Favorite Food': ['Tsebhi', 'Shiro', 'Qulwa', 'Pizza'], 
 "Weight Gained":"Non-Negligable"})

In [896]:
dict

{'First Name': 'Mikias',
 'Username': 'MikiasHWT',
 'Birthplace': 'Asmara, Eritrea aka: The Motherland',
 'Favorite Food': ['Tsebhi', 'Shiro', 'Qulwa', 'Pizza'],
 'Weight Gained': 'Non-Negligable'}

In [897]:
# Key:Value pairs can also be deleted
del dict["Weight Gained"]

In [898]:
dict

{'First Name': 'Mikias',
 'Username': 'MikiasHWT',
 'Birthplace': 'Asmara, Eritrea aka: The Motherland',
 'Favorite Food': ['Tsebhi', 'Shiro', 'Qulwa', 'Pizza']}

### Stacks : TBL
- a linear data structure that follows the LIFO (Last In, First Out) principle.
- Elements are added and removed from the top of the stack.
Common operations include:
    - Push: Adding an element to the top.
    - Pop: Removing the top element.
    - Peek: Viewing the top element without removing it.
- Example: Managing browser history or undo operations in text editors.
- stacks can be implemented using lists or the collections.deque module.

### Queue : TBL
- a linear data structure that follows the FIFO (First In, First Out) principle.
- Elements are added at the rear and removed from the front.
Common operations include:
    - Enqueue: Adding an element to the rear.
    - Dequeue: Removing an element from the front.
- Example: Handling tasks in a printer queue or CPU scheduling.
- queues can be implemented using lists, collections.deque, or the queue module

### Graphs : TBL
- a non-linear data structure consisting of nodes (vertices) and edges (connections between nodes).
- Graphs can be:
    - Directed: Edges have a direction (one-way).
    - Undirected: Edges have no direction (two-way).
    - Weighted: Edges have weights (costs) associated with them.
- Graphs are used to model relationships and are widely used in networking, social media, and pathfinding algorithms (e.g., shortest path problems)
- graphs can be implemented using dictionaries or external libraries like NetworkX.

### Trees : TBL
- a hierarchical data structure made of nodes
    - The top node is called the root.
    - Each node has children and one parent (except the root).
    - Nodes with no children are called leaves.
- Special types of trees include:
    - Binary Trees: Each node has at most two children (left and right).
    - Binary Search Trees (BST): A binary tree where the left child is smaller and the right child is larger than the parent.
    - AVL Trees and Red-Black Trees: Self-balancing binary search trees.
- Trees are used in many applications like parsing expressions, file systems, and databases.
- trees can be implemented using classes or using libraries like anytree

### File : TBL
- used for persistent data storage.
- A file contains data (text or binary) and is stored on a storage device.
- Common file operations include:
        - Read: Extracting data from a file.
        - Write: Writing data to a file.
        - Append: Adding data to the end of an existing file.
    Example: Reading or writing to a .txt, .csv, or .json file.
- file handling is done through built-in functions like open(), and more advanced file handling is possible with libraries like pandas for structured data

# Comparisons

## Logical Operators

In [899]:
# Equal
2 == 2 # True
2 == 3 # False

"Apples" == "Oranges" # False
"Apples" == "Apples" # True

True

False

False

True

In [900]:
# Double Negatives
not(2 == 2) # False
not(2 == 3) # True

not("Apples" == "Oranges") # True
not("Apples" == "Apples") # False

False

True

True

False

In [901]:
# AND logic
(2 == 2) and (2 == 3) # False
("Apples" == "Apples") and ("Oranges" == "Oranges") # True

False

True

In [902]:
# OR logic
(2 == 2) or (2 == 3) # True
(2 == 4) or (2 == 3) # False
("Apples" == "Apples") or ("Oranges" == "Oranges") # True

True

False

True

In [903]:
# Not Equal
2 != 2 # False
2 != 3 # True

"Apples" != "Oranges" # True
"Apples" != "Apples" # False

False

True

True

False

In [904]:
# Greater than 
2 > 3 # False
3 > 2 # True

"AAAA" > "BBB" # False (alphabet comparison)
len("AAAA") > len("BBB") # True

"C" > "BBB" # True 
len("C") > len("BBB") # False

False

True

False

True

True

False

In [905]:
# Greater than or equal to
2 >= 3 # False
3 >= 3 # True
4 >= 3 # True

False

True

True

In [906]:
# Less than 
2 < 3 # True
3 < 2 # False

True

False

In [907]:
# Less than or equal to
2 <= 3 # True
3 <= 3 # True
4 <= 3 # False

True

True

False

## Membership Operators

In [908]:
# In
Sentence="Apples are not the same as oranges."

"Apples" in Sentence # True
"." in Sentence # True
"apples" in Sentence # False (Case sensitive)
"Pears" in Sentence # False
"!" in Sentence # False

True

True

False

False

False

In [909]:
Numbers=[1,3,4,7,8]

1 in Numbers # True
2 in Numbers # False

True

False

In [910]:
# Not In
Sentence="Apples are not the same as oranges."

"Apples" not in Sentence # False
"." not in Sentence # True
"apples" not in Sentence # True (Case sensitive)
"Pears" not in Sentence # True
"!" not in Sentence # False

False

False

True

True

True

In [911]:
Numbers=[1,3,4,7,8]

1 not in Numbers # False
2 not in Numbers # True

False

True

# If Else
- conditional statements used for decision-making

![IF -> ELIF -> Else](img\python-if-elif-else.png)

In [912]:
if 20 > 10:
    print("20 is greater than 10")
else:
    print("Hmm...maybe its not")

20 is greater than 10

In [913]:
# Checking mutliple conditions. 
if (20 < 10) or (10 > 20):
    print("20 is less than 10")
else:
    print("BOOM, I knew it! 20 IS bigger than 10.")

BOOM, I knew it! 20 IS bigger than 10.

In [914]:
# Writing it in one line
print("It worked") if 10>20 else print("10 is not bigger than 20")

10 is not bigger than 20

In [915]:
# Nested statements
if (20 > 10) and (10 < 20):
    print("20 is greater than 10")
    if (20 > 9):
        print("Another victory for 20, which is greater than 9")
else:
    print("Hmm 20 taking some L's")

20 is greater than 10
Another victory for 20, which is greater than 9

# For Loops
- used to iterate over a sequence (such as a list, tuple, string, or range) and execute a block of code multiple times.

![For Loop](img\python-for-loop.png)

In [916]:
# Iterate over list
a_list=[1, 2, 3, 4, "apple", 3j]

for items in a_list:
    print(items)

1
2
3
4
apple
3j

In [917]:
# List items arent essential
for items in a_list:
    print("items")

items
items
items
items
items
items

In [918]:
# Their use can even get wierd
for items in a_list:
    print(items + items)

2
4
6
8
appleapple
6j

In [919]:
# Iterate over dictionary
hobbies={"sports":"soccer", "self-care":"Comedy", "educational":["Design", "Reading", "Coding"]}

# Call values
for things in hobbies.values():
    print(things)

soccer
Comedy
['Design', 'Reading', 'Coding']

In [920]:
# Call keys
for things in hobbies.keys():
    print(things)

sports
self-care
educational

In [921]:
# Call Key:Value pairs (must define them)
for category, hobby in hobbies.items():
    print(category, "->", hobby)

sports -> soccer
self-care -> Comedy
educational -> ['Design', 'Reading', 'Coding']

In [922]:
# Call Key:Value pairs (must define them, in order of Key:Value)
for Random, aaaaaaaa in hobbies.items():
    print(aaaaaaaa, "-%&%-", Random)

soccer -%&%- sports
Comedy -%&%- self-care
['Design', 'Reading', 'Coding'] -%&%- educational

In [923]:
# Nester for loops
Adjective=["blue", "small", "foreign"]
Noun=["shirt", "table", "pen"]
Verb=["smells", "eats", "walks"]

for adjs in Adjective:
    for nns in Noun:
        for vrbs in Verb:
            print("The", adjs, nns, vrbs, "and we love it.")

The blue shirt smells and we love it.
The blue shirt eats and we love it.
The blue shirt walks and we love it.
The blue table smells and we love it.
The blue table eats and we love it.
The blue table walks and we love it.
The blue pen smells and we love it.
The blue pen eats and we love it.
The blue pen walks and we love it.
The small shirt smells and we love it.
The small shirt eats and we love it.
The small shirt walks and we love it.
The small table smells and we love it.
The small table eats and we love it.
The small table walks and we love it.
The small pen smells and we love it.
The small pen eats and we love it.
The small pen walks and we love it.
The foreign shirt smells and we love it.
The foreign shirt eats and we love it.
The foreign shirt walks and we love it.
The foreign table smells and we love it.
The foreign table eats and we love it.
The foreign table walks and we love it.
The foreign pen smells and we love it.
The foreign pen eats and we love it.
The foreign pen walks and we love it.

In [924]:
# The rules...need further consideration. 
Adjective=["blue", "small", "foreign"]
Noun=["shirt", "table", "pen"]
Verb=["smells", "eats", "walks"]

for nns in Noun:
    for nns in Noun:
        for vrbs in Verb:
            for adjs in Adjective:
                for adjs in Adjective:
                    print("The", nns, vrbs,"and we are confused.")

The shirt smells and we are confused.
The shirt smells and we are confused.
The shirt smells and we are confused.
The shirt smells and we are confused.
The shirt smells and we are confused.
The shirt smells and we are confused.
The shirt smells and we are confused.
The shirt smells and we are confused.
The shirt smells and we are confused.
The shirt eats and we are confused.
The shirt eats and we are confused.
The shirt eats and we are confused.
The shirt eats and we are confused.
The shirt eats and we are confused.
The shirt eats and we are confused.
The shirt eats and we are confused.
The shirt eats and we are confused.
The shirt eats and we are confused.
The shirt walks and we are confused.
The shirt walks and we are confused.
The shirt walks and we are confused.
The shirt walks and we are confused.
The shirt walks and we are confused.
The shirt walks and we are confused.
The shirt walks and we are confused.
The shirt walks and we are confused.
The shirt walks and we are confused.
The table smells and we are confused.
The table smells and we are confused.
The table smells and we are confused.
The table smells and we are confused.
The table smells and we are confused.
The table smells and we are confused.
The table smells and we are confused.
The table smells and we are confused.
The table smells and we are confused.
The table eats and we are confused.
The table eats and we are confused.
The table eats and we are confused.
The table eats and we are confused.
The table eats and we are confused.
The table eats and we are confused.
The table eats and we are confused.
The table eats and we are confused.
The table eats and we are confused.
The table walks and we are confused.
The table walks and we are confused.
The table walks and we are confused.
The table walks and we are confused.
The table walks and we are confused.
The table walks and we are confused.
The table walks and we are confused.
The table walks and we are confused.
The table walks and we are confused.
The pen smells and we are confused.
The pen smells and we are confused.
The pen smells and we are confused.
The pen smells and we are confused.
The pen smells and we are confused.
The pen smells and we are confused.
The pen smells and we are confused.
The pen smells and we are confused.
The pen smells and we are confused.
The pen eats and we are confused.
The pen eats and we are confused.
The pen eats and we are confused.
The pen eats and we are confused.
The pen eats and we are confused.
The pen eats and we are confused.
The pen eats and we are confused.
The pen eats and we are confused.
The pen eats and we are confused.
The pen walks and we are confused.
The pen walks and we are confused.
The pen walks and we are confused.
The pen walks and we are confused.
The pen walks and we are confused.
The pen walks and we are confused.
The pen walks and we are confused.
The pen walks and we are confused.
The pen walks and we are confused.
The shirt smells and we are confused.
The shirt smells and we are confused.
The shirt smells and we are confused.
The shirt smells and we are confused.
The shirt smells and we are confused.
The shirt smells and we are confused.
The shirt smells and we are confused.
The shirt smells and we are confused.
The shirt smells and we are confused.
The shirt eats and we are confused.
The shirt eats and we are confused.
The shirt eats and we are confused.
The shirt eats and we are confused.
The shirt eats and we are confused.
The shirt eats and we are confused.
The shirt eats and we are confused.
The shirt eats and we are confused.
The shirt eats and we are confused.
The shirt walks and we are confused.
The shirt walks and we are confused.
The shirt walks and we are confused.
The shirt walks and we are confused.
The shirt walks and we are confused.
The shirt walks and we are confused.
The shirt walks and we are confused.
The shirt walks and we are confused.
The shirt walks and we are confused.
The table smells and we are confused.
The table smells and we are confused.
The table smells and we are confused.
The table smells and we are confused.
The table smells and we are confused.
The table smells and we are confused.
The table smells and we are confused.
The table smells and we are confused.
The table smells and we are confused.
The table eats and we are confused.
The table eats and we are confused.
The table eats and we are confused.
The table eats and we are confused.
The table eats and we are confused.
The table eats and we are confused.
The table eats and we are confused.
The table eats and we are confused.
The table eats and we are confused.
The table walks and we are confused.
The table walks and we are confused.
The table walks and we are confused.
The table walks and we are confused.
The table walks and we are confused.
The table walks and we are confused.
The table walks and we are confused.
The table walks and we are confused.
The table walks and we are confused.
The pen smells and we are confused.
The pen smells and we are confused.
The pen smells and we are confused.
The pen smells and we are confused.
The pen smells and we are confused.
The pen smells and we are confused.
The pen smells and we are confused.
The pen smells and we are confused.
The pen smells and we are confused.
The pen eats and we are confused.
The pen eats and we are confused.
The pen eats and we are confused.
The pen eats and we are confused.
The pen eats and we are confused.
The pen eats and we are confused.
The pen eats and we are confused.
The pen eats and we are confused.
The pen eats and we are confused.
The pen walks and we are confused.
The pen walks and we are confused.
The pen walks and we are confused.
The pen walks and we are confused.
The pen walks and we are confused.
The pen walks and we are confused.
The pen walks and we are confused.
The pen walks and we are confused.
The pen walks and we are confused.
The shirt smells and we are confused.
The shirt smells and we are confused.
The shirt smells and we are confused.
The shirt smells and we are confused.
The shirt smells and we are confused.
The shirt smells and we are confused.
The shirt smells and we are confused.
The shirt smells and we are confused.
The shirt smells and we are confused.
The shirt eats and we are confused.
The shirt eats and we are confused.
The shirt eats and we are confused.
The shirt eats and we are confused.
The shirt eats and we are confused.
The shirt eats and we are confused.
The shirt eats and we are confused.
The shirt eats and we are confused.
The shirt eats and we are confused.
The shirt walks and we are confused.
The shirt walks and we are confused.
The shirt walks and we are confused.
The shirt walks and we are confused.
The shirt walks and we are confused.
The shirt walks and we are confused.
The shirt walks and we are confused.
The shirt walks and we are confused.
The shirt walks and we are confused.
The table smells and we are confused.
The table smells and we are confused.
The table smells and we are confused.
The table smells and we are confused.
The table smells and we are confused.
The table smells and we are confused.
The table smells and we are confused.
The table smells and we are confused.
The table smells and we are confused.
The table eats and we are confused.
The table eats and we are confused.
The table eats and we are confused.
The table eats and we are confused.
The table eats and we are confused.
The table eats and we are confused.
The table eats and we are confused.
The table eats and we are confused.
The table eats and we are confused.
The table walks and we are confused.
The table walks and we are confused.
The table walks and we are confused.
The table walks and we are confused.
The table walks and we are confused.
The table walks and we are confused.
The table walks and we are confused.
The table walks and we are confused.
The table walks and we are confused.
The pen smells and we are confused.
The pen smells and we are confused.
The pen smells and we are confused.
The pen smells and we are confused.
The pen smells and we are confused.
The pen smells and we are confused.
The pen smells and we are confused.
The pen smells and we are confused.
The pen smells and we are confused.
The pen eats and we are confused.
The pen eats and we are confused.
The pen eats and we are confused.
The pen eats and we are confused.
The pen eats and we are confused.
The pen eats and we are confused.
The pen eats and we are confused.
The pen eats and we are confused.
The pen eats and we are confused.
The pen walks and we are confused.
The pen walks and we are confused.
The pen walks and we are confused.
The pen walks and we are confused.
The pen walks and we are confused.
The pen walks and we are confused.
The pen walks and we are confused.
The pen walks and we are confused.
The pen walks and we are confused.

# While Loops
- repeatedly executes a block of code as long as a specified condition remains True

![While Loop](img\python-while-loop.png)

In [925]:
# Continues until the condition is not true
num=1

while num <= 10:
    print(num)
    num = num + 1

1
2
3
4
5
6
7
8
9
10

In [926]:
# Else statement
num=1

while num <= 10:
    print(num)
    if num == 11:
        break
    num = num + 1
else:
    print("Eleve... \nOops, were we supposed to stop at 10?")

1
2
3
4
5
6
7
8
9
10
Eleve...
Oops, were we supposed to stop at 10?

In [927]:
# Continue statement ("continue" returns loop back to "while" when its condition is met. 
########### Creating an infinite loop)

# num=1

# while num <= 10:
#     print(num)
#     if num == 9:
#         continue
#     num = num + 1
# else:
#     print("This wont print with an infinite loop")

In [928]:
# Continue statement without infinite loop

num=1

while num <= 10:
    num = num + 1
    if num == 9:
        continue
    print(num)
else:
    print("We skipped #9 but included #11. \nBecause'continue' returns the loop to the 'while' conditional \nthereby subverting #9 output \nand enforcing #11 output")

2
3
4
5
6
7
8
10
11
We skipped #9 but included #11.
Because'continue' returns the loop to the 'while' conditional
thereby subverting #9 output
and enforcing #11 output

# Functions
- a block of reusable code that performs a specific task
-  Functions can accept inputs called arguments or parameters, which allow you to pass values into the function.

In [929]:
# writing a useless function
def useless():
    print("We did it!")

# calling said useless function
useless()

We did it!

In [930]:
# Function definition with name arguments
def greet(name):
    return f"Hello, {name}!"

# Function call
print(greet("Mikias"))

Hello, Mikias!

In [931]:
# Squaring a number
def num_squared(num):
    print(num**2)

# Call it
num_squared(1)
num_squared(2)
num_squared(3)
num_squared(4)
num_squared(5)

1
4
9
16
25

In [932]:
# Multiple arguments
def num_raised_to(num, power):
    print(num**power)

# Call it
num_raised_to(2,0)
num_raised_to(2,1)
num_raised_to(2,2)
num_raised_to(2,3)

1
2
4
8

In [933]:
# keyword arguments for increased flexibility in calling arguments. 
def num_raised_to(num, power):
    print(num**power)

# Call it by specifying arguments. 
num_raised_to(power=0, num=2)
num_raised_to(num=2, power=1)
num_raised_to(power=2, num=2)
num_raised_to(num=2, power=3)

1
2
4
8

In [934]:
# Arbitrary number of arguments
def sum_numbers(*nums):
    total = sum(nums)  
    print(f"Sum of {nums} = {total}")

# Call the function with different numbers of arguments
sum_numbers(1, 2, 3)
sum_numbers(5, 10, 15, 20, 25)
sum_numbers(100, 200)

Sum of (1, 2, 3) = 6
Sum of (5, 10, 15, 20, 25) = 75
Sum of (100, 200) = 300

In [935]:
# To pass a list or tuple, they must be unpacked with '*'
def sum_numbers(*nums):
    total = sum(nums)  
    print(f"Sum of {nums} = {total}")

# Upack with * (or they will be treated as a single argument)
a_tuple = (1, 2, 3)
sum_numbers(*a_tuple)

a_list = [5, 10, 15]
sum_numbers(*a_list)

Sum of (1, 2, 3) = 6
Sum of (5, 10, 15) = 30

In [936]:
# Passing dictionaries (or DF's)
def display_info(**kwargs):
    print("Name:", kwargs['name'])
    print("Age:", kwargs['age'])  
    print("City:", kwargs['city'])

# Calling the function without the 'age' argument
display_info(name="John", age=30, city="Seattle")
print("")
display_info(name="Lisa", age=28, city="LA", state="California") # unspecified key:value pairs will get skipped

# Missing key:value pairs that are specified in function will throw an error
# display_info(name="Mike", city="New York")

Name: John
Age: 30
City: Seattle

Name: Lisa
Age: 28
City: LA

In [937]:
# Functions and for loops
def create_profile(**info):
    for key, value in info.items():
        print(f"{key}: {value}")

# Call the function with different sets of keyword arguments (no errors)
create_profile(name="John", age=30, profession="Engineer")
print()
create_profile(name="Alice", age=25, location="New York", hobby="Photography", pet="Dog")
print()
create_profile(name="Mike", city="New York")

name: John
age: 30
profession: Engineer

name: Alice
age: 25
location: New York
hobby: Photography
pet: Dog

name: Mike
city: New York

In [938]:
import pandas as pd

# Passing a Dataframe into function (requires unpacking with **)
data = {
    'name': ['John', 'Alice', 'Bob'],
    'age': [25, 30, 22],
    'city': ['Seattle', 'New York', 'Los Angeles'],
    'profession': ['Engineer', 'Designer', 'Writer']
}

df = pd.DataFrame(data)

# Function to create a personal profile using **kwargs
def create_profile(**info):
    for key, value in info.items():
        print(f"{key}: {value}")
    print()  # blank line

# Loop through the DataFrame rows and pass each row to the function (unpacking it into dictionaries per person)
for index, row in df.iterrows():
    create_profile(**row)

name: John
age: 25
city: Seattle
profession: Engineer

name: Alice
age: 30
city: New York
profession: Designer

name: Bob
age: 22
city: Los Angeles
profession: Writer

# List Comprehension
- a concise and efficient way to create lists. (better than for loops)

Basic syntax

```python
[expression for item in iterable if condition]
```

- Expression: This is the value or operation that forms the elements of the new list.
- Item: Represents each element in the iterable (like in a loop).
- Iterable: This is the sequence or collection you're iterating over (like a list, range, etc.).
- If condition: (Optional) This is a filtering condition that allows you to include only certain elements.

In [939]:
# Traditional For Loop
numbers = [1, 2, 3, 4, 5]
squares = []

for num in numbers:
    squares.append(num ** 2)
print(squares)

[1, 4, 9, 16, 25]

In [940]:
# Using list comprehension
numbers = [1, 2, 3, 4, 5]

squares = [num ** 2 for num in numbers]

print(squares)

[1, 4, 9, 16, 25]

# Converting Data Types

## Converting Primitives

In [941]:
# define integer
num_int=7
type(num_int)

# define string
num_str="7"
type(num_str)

int

str

In [942]:
# TypeError: unsupported operand type(s) for +: 'int' and 'str'

# num_int + num_str

In [943]:
# Converting from string to integer 
convert_num=int(num_str)
type(convert_num)

convert_num + num_int

int

14

In [944]:
# Converting from integer to string
convert_str=str(num_int)
type(convert_str)

convert_str + num_str

str

'77'

## Converting Non-Primitives

In [945]:
# define list
a_list=[1,2,3]
type(a_list)

# define tuple
a_tuple=(1,2,3)
type(a_tuple)

list

tuple

In [946]:
# Converting list -> tuple
convert_tuple=tuple(a_list)
type(convert_tuple)

tuple

In [947]:
# Converting tuple -> list
convert_list=list(a_tuple)
type(convert_list)

list

In [948]:
# Convert list -> set
another_list=[1,2,2,2,3,3]
convert_set=set(another_list)
type(convert_set)

# But sets only retain unique values
convert_set

set

{1, 2, 3}

In [949]:
# Converting dictionary
dict_type={"name":"Mikias", "username":"MikiasHWT", "Age":"31"}
type(dict_type)

dict_type.keys()
dict_type.values()
dict_type.items()

dict

dict_keys(['name', 'username', 'Age'])

dict_values(['Mikias', 'MikiasHWT', '31'])

dict_items([('name', 'Mikias'), ('username', 'MikiasHWT'), ('Age', '31')])

In [950]:
# Converting portions of dictionary to lists
print("___________________keys -> lists______________________")
convert_keys=list(dict_type.keys())
type(convert_keys)
convert_keys
convert_keys[0]
convert_keys[1]
convert_keys[2]

print("__________________values -> lists_____________________")

convert_vals=list(dict_type.values())
type(convert_vals)
convert_vals
convert_vals[0]
convert_vals[1]
convert_vals[2]

print("__________________items -> lists______________________")

convert_items=list(dict_type.items())
type(convert_items)
convert_items
convert_items[0]
convert_items[1]
convert_items[2]

___________________keys -> lists______________________

list

['name', 'username', 'Age']

'name'

'username'

'Age'

__________________values -> lists_____________________

list

['Mikias', 'MikiasHWT', '31']

'Mikias'

'MikiasHWT'

'31'

__________________items -> lists______________________

list

[('name', 'Mikias'), ('username', 'MikiasHWT'), ('Age', '31')]

('name', 'Mikias')

('username', 'MikiasHWT')

('Age', '31')

In [951]:
# Long strong -> lists (essentially parsing a sentence)
sentence="My name is Mikias and I am currently 31 years old"
sentence_list=list(sentence)
type(sentence_list)
sentence_list[:17]

list

['M',
 'y',
 ' ',
 'n',
 'a',
 'm',
 'e',
 ' ',
 'i',
 's',
 ' ',
 'M',
 'i',
 'k',
 'i',
 'a',
 's']

# Pandas

In [952]:
import pandas as pd
pd.__version__

pd?

'2.2.3'

Type:        module
String form: <module 'pandas' from 'c:\\Users\\Owner\\Documents\\GitHub\\PythonDataScienceHandbook\\.venv\\Lib\\site-packages\\pandas\\__init__.py'>
File:        c:\users\owner\documents\github\pythondatasciencehandbook\.venv\lib\site-packages\pandas\__init__.py
Docstring:
pandas - a powerful data analysis and manipulation library for Python
=====================================================================

**pandas** is a Python package providing fast, flexible, and expressive data
structures designed to make working with "relational" or "labeled" data both
easy and intuitive. It aims to be the fundamental high-level building block for
doing practical, **real world** data analysis in Python. Additionally, it has
the broader goal of becoming **the most powerful and flexible open source data
analysis / manipulation tool available in any language**. It is already well on
its way toward this goal.

Main Features
-------------
Here are just a few of the things that pandas does well:

  - Easy handling of missing data in floating point as well as non-floating
    point data.
  - Size mutability: columns can be inserted and deleted from DataFrame and
    higher dimensional objects
  - Automatic and explicit data alignment: objects can be explicitly aligned
    to a set of labels, or the user can simply ignore the labels and let
    `Series`, `DataFrame`, etc. automatically align the data for you in
    computations.
  - Powerful, flexible group by functionality to perform split-apply-combine
    operations on data sets, for both aggregating and transforming data.
  - Make it easy to convert ragged, differently-indexed data in other Python
    and NumPy data structures into DataFrame objects.
  - Intelligent label-based slicing, fancy indexing, and subsetting of large
    data sets.
  - Intuitive merging and joining data sets.
  - Flexible reshaping and pivoting of data sets.
  - Hierarchical labeling of axes (possible to have multiple labels per tick).
  - Robust IO tools for loading data from flat files (CSV and delimited),
    Excel files, databases, and saving/loading data from the ultrafast HDF5
    format.
  - Time series-specific functionality: date range generation and frequency
    conversion, moving window statistics, date shifting and lagging.

## Pandas Series
A Pandas ``Series`` is a one-dimensional array of indexed data.

In [953]:
# Creatinga a pandas series
data = pd.Series([0.25, 0.5, 0.75, 1.0])
data

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

The ``Series`` wraps both a sequence of values and a sequence of indices, which can be accessed with the ``values`` and ``index`` attributes.
The ``values`` are simply a familiar NumPy array:

In [954]:
# values
data.values

array([0.25, 0.5 , 0.75, 1.  ])

In [955]:
# Indices 
data.index

RangeIndex(start=0, stop=4, step=1)

In [956]:
# indexing returns associated value
data[1]

np.float64(0.5)

In [957]:
# slicing
data[1:3]

1    0.50
2    0.75
dtype: float64

Numpy Array has an *implicitly defined* integer index used to access the values

the Pandas ``Series`` has an *explicitly defined* index associated with the values.

This gives the ``Series`` object additional capabilities. ie: the index need not be an integer, but can consist of values of any desired type such as strings.

In [958]:
# Series as generalized NumPy array
data = pd.Series([0.25, 0.5, 0.75, 1.0], 
                 index=['one', 'two', 'three', 'four'])

data

one      0.25
two      0.50
three    0.75
four     1.00
dtype: float64

In [959]:
# indexing
data["one"]

np.float64(0.25)

In [960]:
# list items
list(data.items())

[('one', 0.25), ('two', 0.5), ('three', 0.75), ('four', 1.0)]

In [961]:
# append
data['five'] = 1.25

data

one      0.25
two      0.50
three    0.75
four     1.00
five     1.25
dtype: float64

In [962]:
# slicing by explicit index (final index included)
data['two':'four']

two      0.50
three    0.75
four     1.00
dtype: float64

In [963]:
# slicing by implicit integer index (final index excluded)
data[0:2]

one    0.25
two    0.50
dtype: float64

In [964]:
# masking
data[(data > 0.3) & (data < 0.8)]

two      0.50
three    0.75
dtype: float64

In [965]:
# Non sequential data
data = pd.Series([0.25, 0.5, 0.75, 1.0], 
                 index=[2, 5, 3, 7])

data

2    0.25
5    0.50
3    0.75
7    1.00
dtype: float64

In [966]:
data[5]

np.float64(0.5)

the ``loc`` attribute allows indexing and slicing that always references the explicit index:

In [967]:
data = pd.Series(['a', 'b', 'c'], index=[1, 3, 5])
data

1    a
3    b
5    c
dtype: object

In [968]:
# Explicit indexing 
data.loc[1]

data.loc[1:3]

'a'

1    a
3    b
dtype: object

The ``iloc`` attribute allows indexing and slicing that always references the implicit Python-style index:

In [969]:
# Implicit indexing
data.iloc[1]

data.iloc[1:3]

'b'

3    b
5    c
dtype: object

A dictionary is a structure that maps arbitrary keys to a set of arbitrary values

``Series`` is a structure which maps typed keys to a set of typed values.

This typing is important: just as the type-specific compiled code behind a NumPy array makes it more efficient than a Python list for certain operations, the type information of a Pandas ``Series`` makes it much more efficient than Python dictionaries for certain operations.

The ``Series``-as-dictionary analogy can be made even more clear by constructing a ``Series`` object directly from a Python dictionary:

In [970]:
# Dictrionary to Series
population_dict = {'California': 38332521, 
                   'Texas': 26448193,
                   'New York': 19651127,
                   'Florida': 19552860,
                   'Illinois': 12882135}

population = pd.Series(population_dict)

population

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

In [971]:
# indexing like dicts
population["California"]

np.int64(38332521)

In [972]:
# slicing like array (inclusive)
population["Texas":"Illinois"]

Texas       26448193
New York    19651127
Florida     19552860
Illinois    12882135
dtype: int64

In [973]:
# default intex is integer sequence
pd.Series([2, 4, 6])

0    2
1    4
2    6
dtype: int64

In [974]:
# data can a scalar set to repeat
pd.Series(5, index=["first", "second", "third"])

first     5
second    5
third     5
dtype: int64

In [975]:
# data can be a dict, where index defailt to dict keys
pd.Series({2:'a', 1:'b', 3:'c'})

2    a
1    b
3    c
dtype: object

In [976]:
# populate only with specified index vales
pd.Series({2:'a', 1:'b', 3:'c'}, index=[3, 2])

3    c
2    a
dtype: object

## Dataframe
the ``DataFrame`` can be thought of either as a generalization of a NumPy array, or as a specialization of a Python dictionary.

If a ``Series`` is an analog of a one-dimensional array with flexible indices, 

a ``DataFrame`` is an analog of a two-dimensional array with both flexible row indices and flexible column names.

Just as you might think of a two-dimensional array as an ordered sequence of aligned one-dimensional columns, you can think of a ``DataFrame`` as a sequence of aligned ``Series`` objects.
"aligned" meaning that they share the same index.

In [977]:
# Construct a Series 
area_dict = {'California':423967, 'Texas': 695662, 'New York': 141297, 
             'Florida': 170312, 'Illinois': 149995}

area = pd.Series(area_dict)

area

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
dtype: int64

In [978]:
population_dict = {'California': 38332521,
                   'Texas': 26448193,
                   'New York': 19651127,
                   'Florida': 19552860,
                   'Illinois': 12882135}

population = pd.Series(population_dict)

population

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

In [979]:
# Combine both Series with a dictionairy
states = pd.DataFrame({'population': population, 
                      'area': area})

states

            population    area
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995

In [980]:
# index labels
states.index

Index(['California', 'Texas', 'New York', 'Florida', 'Illinois'], dtype='object')

In [981]:
# column attribute is an index of column labels
states.columns

Index(['population', 'area'], dtype='object')

think of a ``DataFrame`` as a specialization of a dictionary.
Where a dictionary maps a key to a value, a ``DataFrame`` maps a column name to a ``Series`` of column data.

asking for ``area`` attribute returns the ``Series`` object containing the areas data

In [982]:
# indexing
states['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [983]:
# dot notation
states.area

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [984]:
states.area is states['area']

True

In [985]:
# appending with new column
states['density'] = states['population'] / states['area']

states

            population    area     density
California    38332521  423967   90.413926
Texas         26448193  695662   38.018740
New York      19651127  141297  139.076746
Florida       19552860  170312  114.806121
Illinois      12882135  149995   85.883763

In [986]:
# Dataframe as 2-D array
states.values

array([[3.83325210e+07, 4.23967000e+05, 9.04139261e+01],
       [2.64481930e+07, 6.95662000e+05, 3.80187404e+01],
       [1.96511270e+07, 1.41297000e+05, 1.39076746e+02],
       [1.95528600e+07, 1.70312000e+05, 1.14806121e+02],
       [1.28821350e+07, 1.49995000e+05, 8.58837628e+01]])

In [987]:
# Transpose 
states.T

,California,Texas,New York,Florida,Illinois
population,3.833252e+07,2.644819e+07,1.965113e+07,1.955286e+07,1.288214e+07
area,4.239670e+05,6.956620e+05,1.412970e+05,1.703120e+05,1.499950e+05
density,9.041393e+01,3.801874e+01,1.390767e+02,1.148061e+02,8.588376e+01

In [988]:
# constructing a dataframe
pd.DataFrame(population, columns=['population'])

            population
California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135

In [989]:
# Dataframe from 2-dimensional NumPy array
pd.DataFrame(np.random.rand(3, 2),
             columns=['foo', 'bar'],
             index=['a', 'b', 'c'])

        foo       bar
a  0.662527  0.013572
b  0.622846  0.673660
c  0.971945  0.878193

In [990]:
# Dataframe from structured array 
A = np.zeros(3, dtype=[('A', 'i8'), ('B', 'f8')])

A

pd.DataFrame(A)

array([(0, 0.), (0, 0.), (0, 0.)], dtype=[('A', '<i8'), ('B', '<f8')])

   A    B
0  0  0.0
1  0  0.0
2  0  0.0

In [991]:
# Create a sample DataFrame
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
        'Age': [25, 30, 35, 40],
        'Score': [85, 90, 95, 100]}

df = pd.DataFrame(data, index=['A', 'B', 'C', 'D'])

print("DataFrame:")
print(df)

DataFrame:
      Name  Age  Score
A    Alice   25     85
B      Bob   30     90
C  Charlie   35     95
D    David   40    100

## Index Based Selection

iloc : Selecting data based on its numerical position in the data.

In [992]:
# Access 2nd elements of all columns
df.iloc[1]

Name     Bob
Age       30
Score     90
Name: B, dtype: object

In [993]:
# Access specific value using row at index 1 and column at index 
df.iloc[1, 2]

np.int64(90)

In [994]:
# to retrive a column
df.iloc[:, 0]

A      Alice
B        Bob
C    Charlie
D      David
Name: Name, dtype: object

## Label-based selection

loc : selects from the data index value, not its position.

In [995]:
df.loc[:, 'Age']

A    25
B    30
C    35
D    40
Name: Age, dtype: int64

## Manipulating DF's

In [996]:
# Setting index
df_new = df.set_index("Name")

print("New DataFrame:")
print(df_new)

New DataFrame:
         Age  Score
Name
Alice     25     85
Bob       30     90
Charlie   35     95
David     40    100

In [997]:
# Conditional selection
df.Age == 30

A    False
B     True
C    False
D    False
Name: Age, dtype: bool

In [998]:
# Conditional subsetting
df.loc[df.Age == 30]

  Name  Age  Score
B  Bob   30     90

In [999]:
# Conditional subsetting with logical operators 
# and = &
# or = |
# is in = isin()
df.loc[(df.Age >= 35) & (df.Score >= 100)]

    Name  Age  Score
D  David   40    100

In [1000]:
# Assigning data
df["Tried Hard"] = "Yes"

df

      Name  Age  Score Tried Hard
A    Alice   25     85        Yes
B      Bob   30     90        Yes
C  Charlie   35     95        Yes
D    David   40    100        Yes

## Summaries and maps

In [1001]:
df

      Name  Age  Score Tried Hard
A    Alice   25     85        Yes
B      Bob   30     90        Yes
C  Charlie   35     95        Yes
D    David   40    100        Yes

### Summaries

In [1002]:
# Common stats for numerical variables
df.describe()

             Age       Score
count   4.000000    4.000000
mean   32.500000   92.500000
std     6.454972    6.454972
min    25.000000   85.000000
25%    28.750000   88.750000
50%    32.500000   92.500000
75%    36.250000   96.250000
max    40.000000  100.000000

In [1003]:
# Descibe for categoricals
df["Tried Hard"].describe()

count       4
unique      1
top       Yes
freq        4
Name: Tried Hard, dtype: object

In [1004]:
# mean
df.Score.mean()

np.float64(92.5)

In [1005]:
# Unique values
df.Score.unique()

array([ 85,  90,  95, 100])

In [1006]:
# Count number of instances of a given value
df.Score.value_counts()

Score
85     1
90     1
95     1
100    1
Name: count, dtype: int64

The following table lists Python operators and their equivalent Pandas object methods:

| Python Operator | Pandas Method(s)                      |
|-----------------|---------------------------------------|
| ``+``           | ``add()``                             |
| ``-``           | ``sub()``, ``subtract()``             |
| ``*``           | ``mul()``, ``multiply()``             |
| ``/``           | ``truediv()``, ``div()``, ``divide()``|
| ``//``          | ``floordiv()``                        |
| ``%``           | ``mod()``                             |
| ``**``          | ``pow()``                             |

## Missing Values

In [1007]:
# None (can only be used with dtype: object)
vals1 = np.array([1, None, 3, 4])

vals1

array([1, None, 3, 4], dtype=object)

In [1008]:
# Cannot be aggregated

# vals1.sum()
# TypeError: unsupported operand type(s) for +: 'int' and 'NoneType'

In [1009]:
# NaN, a special floating-point value recognized by all systems that use the IEEE floating-point representation
vals2 = np.array([1, np.nan, 3, 4])

vals2

array([ 1., nan,  3.,  4.])

In [1010]:
# NaN infects everything
1 + np.nan

nan

In [1011]:
# Aggregation wont throw an error, but isnt usefull either
vals2.sum(), vals2.min(), vals2.max()

(np.float64(nan), np.float64(nan), np.float64(nan))

In [1012]:
# aggregation can be done with nan aware functions
np.nansum(vals2), np.nanmin(vals2), np.nanmax(vals2)

(np.float64(8.0), np.float64(1.0), np.float64(4.0))

Pandas treats ``None`` and ``NaN`` as essentially interchangeable for indicating missing or null values.
To facilitate this convention, there are several useful methods for detecting, removing, and replacing null values in Pandas data structures.
They are:

- ``isnull()``: Generate a boolean mask indicating missing values
- ``notnull()``: Opposite of ``isnull()``
- ``dropna()``: Return a filtered version of the data
- ``fillna()``: Return a copy of the data with missing values filled or imputed

In [1013]:
data = pd.Series([1, np.nan, 'hello', None])

data

0        1
1      NaN
2    hello
3     None
dtype: object

In [1014]:
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [1015]:
data[data.notnull()]

0        1
2    hello
dtype: object

In [1016]:
data.dropna()

0        1
2    hello
dtype: object

In [1017]:
# Drop NA works differently for dataframes
df = pd.DataFrame([[1,      np.nan, 2],
                   [2,      3,      5],
                   [np.nan, 4,      6]])

df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [1018]:
# Can only drop entire rows or columns
# Default drops observations
df.dropna()

     0    1  2
1  2.0  3.0  5

In [1019]:
# Drop columns
df.dropna(axis='columns')

   2
0  2
1  5
2  6

In [1020]:
# Fine grained drop control
df[3] = np.nan
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [1021]:
# Drop columns with all NA values
df.dropna(axis='columns', how='all')

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [1022]:
 #specify a minimum number of non-null values for the row/column to be kept
df.dropna(axis='rows', thresh=3)

     0    1  2   3
1  2.0  3.0  5 NaN

In [1023]:
# Filling NA values
data = pd.Series([1, np.nan, 2, None, 3], index=list('abcde'))
data

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [1024]:
data.fillna(0)

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

In [1025]:
# forward-fill
data.ffill()

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

In [1026]:
# back-fill
data.bfill()

a    1.0
b    2.0
c    2.0
d    3.0
e    3.0
dtype: float64

In [1027]:
# need to specify axis for df's
df

df.ffill(axis=1)

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

     0    1    2    3
0  1.0  1.0  2.0  2.0
1  2.0  3.0  5.0  5.0
2  NaN  4.0  6.0  6.0

### Maps

a function that takes one set of values and "maps" them to another set of values.

In [1028]:
# Create a sample DataFrame
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
        'Age': [25, 30, 35, 40],
        'Score': [85, 90, 95, 100]}

df = pd.DataFrame(data, index=['A', 'B', 'C', 'D'])

print("DataFrame:")
print(df)

DataFrame:
      Name  Age  Score
A    Alice   25     85
B      Bob   30     90
C  Charlie   35     95
D    David   40    100

In [1029]:
# Mean centering using map()
# Store mean value
Score_mean_value = df.Score.mean()

# Apply lambda function to shift the mean
# takes each individual n value in score columns and subtracts the mean
df["Centered_scores"] = df.Score.map(lambda n: n - Score_mean_value)

df

      Name  Age  Score  Centered_scores
A    Alice   25     85             -7.5
B      Bob   30     90             -2.5
C  Charlie   35     95              2.5
D    David   40    100              7.5

### Apply
the apply function is a powerful tool used to apply a function along an axis of a DataFrame (rows or columns) or to a Series. It provides flexibility in applying custom functions to manipulate data.
How it Works:

    For a Series:
        You can use apply to apply a function to each element of a Series.

    For a DataFrame:
        You can specify whether to apply the function along the columns (axis=0) or rows (axis=1).

The apply function is often used for data transformations, computations, or even generating new columns based on existing data.

In [1030]:
# Using apply with a Series

# Create a Series
s = pd.Series([1, 2, 3, 4])

# Apply a lambda function to square each element
squared = s.apply(lambda x: x ** 2)

print(squared)

0     1
1     4
2     9
3    16
dtype: int64

In [1031]:
# Using apply on a DataFrame (Column-wise)

# Create a DataFrame
df = pd.DataFrame({
    'A': [1, 2, 3],
    'B': [4, 5, 6],
    'C': [7, 8, 9]
})

# Apply a function along columns (axis=0 by default)
column_sums = df.apply(sum)

print(column_sums)

A     6
B    15
C    24
dtype: int64

In [1032]:
# Using apply on a DataFrame (Row-wise)

# Apply a function along rows (axis=1)
row_sums = df.apply(lambda row: row.sum(), axis=1)

print(row_sums)

0    12
1    15
2    18
dtype: int64

In [1033]:
# Applying a Custom Function

# Custom function to calculate the range (max - min) of values
def calc_range(row):
    return row.max() - row.min()

# Apply the custom function along rows
row_ranges = df.apply(calc_range, axis=1)

print(row_ranges)

0    6
1    6
2    6
dtype: int64

## Grouping and Sorting

### Grouping

In [1277]:
# import seaborne planets dataset

import seaborn as sns
planets = sns.load_dataset('planets')
planets.shape
planets.head()
planets.describe()
planets.dropna().describe()

(1035, 6)

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

          number  orbital_period        mass    distance         year
count  498.00000      498.000000  498.000000  498.000000   498.000000
mean     1.73494      835.778671    2.509320   52.068213  2007.377510
std      1.17572     1469.128259    3.636274   46.596041     4.167284
min      1.00000        1.328300    0.003600    1.350000  1989.000000
25%      1.00000       38.272250    0.212500   24.497500  2005.000000
50%      1.00000      357.000000    1.245000   39.940000  2009.000000
75%      2.00000      999.600000    2.867500   59.332500  2011.000000
max      6.00000    17337.500000   25.000000  354.000000  2014.000000

The following table summarizes some other built-in Pandas aggregations:

| Aggregation              | Description                     |
|--------------------------|---------------------------------|
| ``count()``              | Total number of items           |
| ``first()``, ``last()``  | First and last item             |
| ``mean()``, ``median()`` | Mean and median                 |
| ``min()``, ``max()``     | Minimum and maximum             |
| ``std()``, ``var()``     | Standard deviation and variance |
| ``mad()``                | Mean absolute deviation         |
| ``prod()``               | Product of all items            |
| ``sum()``                | Sum of all items                |

These are all methods of ``DataFrame`` and ``Series`` objects.

In [1278]:
# Group by a variable, note that output is simply a DataFrameGroupBy object
planets.groupby("method")

In [1280]:
# Group by one variable and select another
planets.groupby("method")["orbital_period"]

method
Astrometry                                                        [246.36, 1016.0]
Eclipse Timing Variations        [10220.0, 5767.0, 3321.0, 5573.55, 2883.5, 290...
Imaging                          [nan, 6000.0, 318280.0, 4639.15, 7336.5, 8679....
Microlensing                     [nan, 2780.0, 1970.0, 3600.0, 3300.0, 3500.0, ...
Orbital Brightness Modulation                     [0.240104, 0.342887, 1.54492875]
Pulsar Timing                      [25.262, 66.5419, 98.2114, 36525.0, 0.09070629]
Pulsation Timing Variations                                               [1170.0]
Radial Velocity                  [269.3, 874.774, 763.0, 326.03, 516.22, 185.84...
Transit                          [1.5089557, 1.7429935, 4.2568, 9.20205, 4.0378...
Transit Timing Variations                            [160.0, 57.011, nan, 22.3395]
Name: orbital_period, dtype: object

In [1281]:
# Aggregate numerical variable by grouped categorical variable
planets.groupby("method")["orbital_period"].median()

method
Astrometry                         631.180000
Eclipse Timing Variations         4343.500000
Imaging                          27500.000000
Microlensing                      3300.000000
Orbital Brightness Modulation        0.342887
Pulsar Timing                       66.541900
Pulsation Timing Variations       1170.000000
Radial Velocity                    360.200000
Transit                              5.714932
Transit Timing Variations           57.011000
Name: orbital_period, dtype: float64

In [1282]:
# Iterate over groups
for (method, group) in planets.groupby("method"):
    print("{0:30s} shape={1}".format(method, group.shape))

Astrometry                     shape=(2, 6)
Eclipse Timing Variations      shape=(9, 6)
Imaging                        shape=(38, 6)
Microlensing                   shape=(23, 6)
Orbital Brightness Modulation  shape=(3, 6)
Pulsar Timing                  shape=(5, 6)
Pulsation Timing Variations    shape=(1, 6)
Radial Velocity                shape=(553, 6)
Transit                        shape=(397, 6)
Transit Timing Variations      shape=(4, 6)

In [1284]:
# Dispatch method
# Summary stats on specific groupings
planets.groupby("method")["year"].describe()

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,2.0,2011.500000,2.121320,2010.0,2010.75,2011.5,2012.25,2013.0
Eclipse Timing Variations,9.0,2010.000000,1.414214,2008.0,2009.00,2010.0,2011.00,2012.0
Imaging,38.0,2009.131579,2.781901,2004.0,2008.00,2009.0,2011.00,2013.0
Microlensing,23.0,2009.782609,2.859697,2004.0,2008.00,2010.0,2012.00,2013.0
Orbital Brightness Modulation,3.0,2011.666667,1.154701,2011.0,2011.00,2011.0,2012.00,2013.0
Pulsar Timing,5.0,1998.400000,8.384510,1992.0,1992.00,1994.0,2003.00,2011.0
Pulsation Timing Variations,1.0,2007.000000,NaN,2007.0,2007.00,2007.0,2007.00,2007.0
Radial Velocity,553.0,2007.518987,4.249052,1989.0,2005.00,2009.0,2011.00,2014.0
Transit,397.0,2011.236776,2.077867,2002.0,2010.00,2012.0,2013.00,2014.0
Transit Timing Variations,4.0,2012.500000,1.290994,2011.0,2011.75,2012.5,2013.25,2014.0

In [1034]:
# Create a DataFrame
data = {'Category': ['A', 'B', 'A', 'B', 'A', 'B', 'C', 'B', 'A', 'C'],
        'Values': [10, 20, 30, 40, 50, 60, 30, 20, 10, 20]}

df = pd.DataFrame(data)

df

  Category  Values
0        A      10
1        B      20
2        A      30
3        B      40
4        A      50
5        B      60
6        C      30
7        B      20
8        A      10
9        C      20

In [1035]:
# Group by 'Category' and count instances
grouped = df.groupby('Category').count()

print(grouped)

# Group by Values and count instances
df.groupby('Values').Category.count()

          Values
Category
A              4
B              4
C              2

Values
10    2
20    3
30    2
40    1
50    1
60    1
Name: Category, dtype: int64

In [1036]:
# Group by 'Category' and apply multiple aggregation functions
grouped = df.groupby('Category').agg(['mean', 'sum', 'max'])

print(grouped)

         Values
           mean  sum max
Category
A          25.0  100  50
B          35.0  140  60
C          25.0   50  30

In [1037]:
# Grouping by Multiple Columns

# Create a more complex DataFrame
data = {'Category': ['A', 'B', 'A', 'B', 'A', 'B'],
        'SubCategory': ['X', 'X', 'Y', 'Y', 'Y', 'X'],
        'Values': [10, 20, 30, 40, 50, 60]}

df = pd.DataFrame(data)

# Group by both 'Category' and 'SubCategory'
grouped = df.groupby(['Category', 'SubCategory']).sum()

print(grouped)

                      Values
Category SubCategory
A        X                10
         Y                80
B        X                80
         Y                40

In [1038]:
# Applying Custom Functions to Groups

# Custom function to calculate the range (max - min)
def calc_range(x):
    return x.max() - x.min()

# Apply the custom function to each group
grouped = df.groupby('Category')['Values'].apply(calc_range)

print(grouped)

Category
A    40
B    40
Name: Values, dtype: int64

In [1039]:
# Filtering Groups

df.groupby('Category').sum()

# Filter groups where the sum of 'Values' is greater than 100
filtered = df.groupby('Category').filter(lambda x: x['Values'].sum() > 100)

print(filtered)

         SubCategory  Values
Category
A                XYY      90
B                XYX     120

  Category SubCategory  Values
1        B           X      20
3        B           Y      40
5        B           X      60

In [1040]:
# Transforming Groups

# Subtract the group mean from each value
df['Centered'] = df.groupby('Category')['Values'].transform(lambda x: x - x.mean())

print(df)

  Category SubCategory  Values  Centered
0        A           X      10     -20.0
1        B           X      20     -20.0
2        A           Y      30       0.0
3        B           Y      40       0.0
4        A           Y      50      20.0
5        B           X      60      20.0

In [1287]:
# Final Grouping example
decade = 10 * (planets['year'] // 10)
decade = decade.astype(str) + "s"
decade.name = 'decade'
planets.groupby(['method', decade])['number'].sum().unstack().fillna(0)

decade                         1980s  1990s  2000s  2010s
method
Astrometry                       0.0    0.0    0.0    2.0
Eclipse Timing Variations        0.0    0.0    5.0   10.0
Imaging                          0.0    0.0   29.0   21.0
Microlensing                     0.0    0.0   12.0   15.0
Orbital Brightness Modulation    0.0    0.0    0.0    5.0
Pulsar Timing                    0.0    9.0    1.0    1.0
Pulsation Timing Variations      0.0    0.0    1.0    0.0
Radial Velocity                  1.0   52.0  475.0  424.0
Transit                          0.0    0.0   64.0  712.0
Transit Timing Variations        0.0    0.0    0.0    9.0

### Multi-Indexing

A MultiIndex is like having multiple levels of row or column labels. It's useful when dealing with high-dimensional data or data that is hierarchically structured

In [1041]:
# Creating a MultiIndex from a DataFrame

# Create a DataFrame
data = {'Category': ['A', 'A', 'B', 'B'],
        'SubCategory': ['X', 'Y', 'X', 'Y'],
        'Values': [10, 20, 30, 40]}

df = pd.DataFrame(data)

# Set 'Category' and 'SubCategory' as MultiIndex
df.set_index(['Category', 'SubCategory'], inplace=True)

type(df)

print(df)

pandas.core.frame.DataFrame

                      Values
Category SubCategory
A        X                10
         Y                20
B        X                30
         Y                40

In [1042]:
# Accessing Data in a MultiIndex DataFrame

# Access data for Category 'A' and SubCategory 'X'
value = df.loc[('A', 'X')]

print(value)

Values    10
Name: (A, X), dtype: int64

In [1043]:
# Slice through different levels of the index.

# Access all data for Category 'A'
a_data = df.loc['A']

print(a_data)

             Values
SubCategory
X                10
Y                20

In [1044]:
# Create a DataFrame
data = {'Category': ['A', 'A', 'B', 'B'],
        'SubCategory': ['X', 'Y', 'X', 'Y'],
        'Values': [10, 20, 30, 40],
        'Amount': [100, 150, 200, 250]}

df = pd.DataFrame(data)

df.set_index(['Category', 'SubCategory'], inplace=True)

print(df)

df = pd.DataFrame(data)

# Stacking and Unstacking a MultiIndex (which converts columns to row levels or vice versa.)
# Unstack the 'SubCategory' index level
unstacked = df.set_index(['Category', 'SubCategory']).unstack()

print("\n", unstacked)

# Stack the unstacked DataFrame
stacked = unstacked.stack()

print("\n", stacked)

                      Values  Amount
Category SubCategory
A        X                10     100
         Y                20     150
B        X                30     200
         Y                40     250

             Values     Amount
SubCategory      X   Y      X    Y
Category
A               10  20    100  150
B               30  40    200  250

                       Values  Amount
Category SubCategory
A        X                10     100
         Y                20     150
B        X                30     200
         Y                40     250

C:\Users\Owner\AppData\Local\Temp\ipykernel_13200\2599008885.py:22: FutureWarning: The previous implementation of stack is deprecated and will be removed in a future version of pandas. See the What's New notes for pandas 2.1.0 for details. Specify future_stack=True to adopt the new implementation and silence this warning.
  stacked = unstacked.stack()

In [1045]:
# Swap the levels of the MultiIndex
swapped = df.set_index(['Category', 'SubCategory']).swaplevel()

print(swapped)

                      Values  Amount
SubCategory Category
X           A             10     100
Y           A             20     150
X           B             30     200
Y           B             40     250

In [1046]:
# Reset the index
reset_df = df.set_index(['Category', 'SubCategory']).reset_index()

print(reset_df)

  Category SubCategory  Values  Amount
0        A           X      10     100
1        A           Y      20     150
2        B           X      30     200
3        B           Y      40     250

### Hierarchical Indexing

In [1093]:
index = [('California', 2000), ('California', 2010),
         ('New York', 2000), ('New York', 2010),
         ('Texas', 2000), ('Texas', 2010)]
populations = [33871648, 37253956,
               18976457, 19378102,
               20851820, 25145561]
pop = pd.Series(populations, index=index)
pop

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
(Texas, 2010)         25145561
dtype: int64

In [1094]:
# Create MultiIndex from tuple
type(index)
MultiIndex = pd.MultiIndex.from_tuples(index)

type(MultiIndex)

MultiIndex

list

pandas.core.indexes.multi.MultiIndex

MultiIndex([('California', 2000),
            ('California', 2010),
            (  'New York', 2000),
            (  'New York', 2010),
            (     'Texas', 2000),
            (     'Texas', 2010)],
           )

In [1095]:
# reindex series
pop = pop.reindex(MultiIndex)

pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [1085]:
# Easily access subset of data
pop[:, 2010]

California    37253956
New York      19378102
Texas         25145561
dtype: int64

In [1098]:
# naming index levels
pop.index.names = ['state', 'year']

pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [1099]:
# Convert a multiIndexed Series into a conventionally indexed DataFrame
pop_df = pop.unstack()

pop_df

year            2000      2010
state
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [1100]:
# Return to MultiIndexed Series
pop_df.stack()

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [1108]:
# Columns can also be MultiIdexed
# hierarchical indices and columns
index = pd.MultiIndex.from_product([[2013, 2014], [1, 2]],
                                   names=['year', 'visit'])
columns = pd.MultiIndex.from_product([['Bob', 'Guido', 'Sue'], ['HR', 'Temp']],
                                     names=['subject', 'type'])

# mock some data
data = np.round(np.random.randn(4, 6), 1)
data[:, ::2] *= 10
data += 37

# create the DataFrame
health_data = pd.DataFrame(data, index=index, columns=columns)
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      26.0  38.0  52.0  36.6  46.0  36.8
     2      45.0  37.3  32.0  38.9  32.0  38.4
2014 1      26.0  37.8  55.0  38.0  21.0  37.2
     2      53.0  35.6  13.0  34.9  27.0  38.0

In [1102]:
# subsetting data
health_data['Guido']

type          HR  Temp
year visit
2013 1      33.0  37.0
     2      44.0  37.4
2014 1      41.0  38.0
     2      33.0  35.9

In [1103]:
health_data.stack()

C:\Users\Owner\AppData\Local\Temp\ipykernel_13200\2364996430.py:1: FutureWarning: The previous implementation of stack is deprecated and will be removed in a future version of pandas. See the What's New notes for pandas 2.1.0 for details. Specify future_stack=True to adopt the new implementation and silence this warning.
  health_data.stack()

subject           Bob  Guido   Sue
year visit type
2013 1     HR    30.0   33.0  41.0
           Temp  37.0   37.0  37.0
     2     HR    34.0   44.0  48.0
           Temp  34.8   37.4  37.2
2014 1     HR    46.0   41.0  32.0
           Temp  37.0   38.0  37.7
     2     HR    48.0   33.0  39.0
           Temp  34.8   35.9  35.9

In [1114]:
# Index setting and reseting
health_data

health_data_flat = health_data.reset_index()

health_data_flat

# Tidy format...?
health_data_stacked_flat = health_data.stack().reset_index()

health_data_stacked_flat

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      26.0  38.0  52.0  36.6  46.0  36.8
     2      45.0  37.3  32.0  38.9  32.0  38.4
2014 1      26.0  37.8  55.0  38.0  21.0  37.2
     2      53.0  35.6  13.0  34.9  27.0  38.0

subject  year visit   Bob       Guido         Sue
type                   HR  Temp    HR  Temp    HR  Temp
0        2013     1  26.0  38.0  52.0  36.6  46.0  36.8
1        2013     2  45.0  37.3  32.0  38.9  32.0  38.4
2        2014     1  26.0  37.8  55.0  38.0  21.0  37.2
3        2014     2  53.0  35.6  13.0  34.9  27.0  38.0

C:\Users\Owner\AppData\Local\Temp\ipykernel_13200\2465200815.py:9: FutureWarning: The previous implementation of stack is deprecated and will be removed in a future version of pandas. See the What's New notes for pandas 2.1.0 for details. Specify future_stack=True to adopt the new implementation and silence this warning.
  health_data_stacked_flat = health_data.stack().reset_index()

subject  year  visit  type   Bob  Guido   Sue
0        2013      1    HR  26.0   52.0  46.0
1        2013      1  Temp  38.0   36.6  36.8
2        2013      2    HR  45.0   32.0  32.0
3        2013      2  Temp  37.3   38.9  38.4
4        2014      1    HR  26.0   55.0  21.0
5        2014      1  Temp  37.8   38.0  37.2
6        2014      2    HR  53.0   13.0  27.0
7        2014      2  Temp  35.6   34.9  38.0

In [1128]:
# Setting MultiIndex
health_data_stacked_flat

health_data_unstacked_flat = health_data_stacked_flat.set_index(['year', 'visit'])

health_data_unstacked_flat

subject  year  visit  type   Bob  Guido   Sue
0        2013      1    HR  26.0   52.0  46.0
1        2013      1  Temp  38.0   36.6  36.8
2        2013      2    HR  45.0   32.0  32.0
3        2013      2  Temp  37.3   38.9  38.4
4        2014      1    HR  26.0   55.0  21.0
5        2014      1  Temp  37.8   38.0  37.2
6        2014      2    HR  53.0   13.0  27.0
7        2014      2  Temp  35.6   34.9  38.0

subject     type   Bob  Guido   Sue
year visit
2013 1        HR  26.0   52.0  46.0
     1      Temp  38.0   36.6  36.8
     2        HR  45.0   32.0  32.0
     2      Temp  37.3   38.9  38.4
2014 1        HR  26.0   55.0  21.0
     1      Temp  37.8   38.0  37.2
     2        HR  53.0   13.0  27.0
     2      Temp  35.6   34.9  38.0

In [1138]:
# Aggregating on multiindexed data
health_data

data_mean = health_data.mean()

data_mean

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      26.0  38.0  52.0  36.6  46.0  36.8
     2      45.0  37.3  32.0  38.9  32.0  38.4
2014 1      26.0  37.8  55.0  38.0  21.0  37.2
     2      53.0  35.6  13.0  34.9  27.0  38.0

subject  type
Bob      HR      37.500
         Temp    37.175
Guido    HR      38.000
         Temp    37.100
Sue      HR      31.500
         Temp    37.600
dtype: float64

### Sorting

`sort_index()`: Sorts the DataFrame/Series by its index (row or column labels).

`sort_values()`: Sorts the DataFrame/Series by the values in one or more columns.

In [1047]:
# Sorting a DataFrame by Row Index

# Create a DataFrame
data = {'Category': ['B', 'A', 'C', 'A', 'B', 'C', 'A', 'C'],
        'Values': [30, 20, 40, 10, 12, 20, 30, 40]}

df = pd.DataFrame(data, index=[3, 2, 4, 1, 5, 7, 6, 8])

# Sort by row index
sorted_df = df.sort_index()

print(df)
print("\n", sorted_df)

  Category  Values
3        B      30
2        A      20
4        C      40
1        A      10
5        B      12
7        C      20
6        A      30
8        C      40

   Category  Values
1        A      10
2        A      20
3        B      30
4        C      40
5        B      12
6        A      30
7        C      20
8        C      40

In [1048]:
data = {
    'D': ['dog', 'cat', 'bird'],
    'B': [15, 10, 5],
    'A': [3.5, 4.1, 2.9],
    'C': [True, False, True]
}

df = pd.DataFrame(data)

print("Original DataFrame:")
print(df)

# Sort the columns by their labels
sorted_columns = df.sort_index(axis=1)
print("\nAxis 1 index sorted DataFrame:")
print(sorted_columns)

Original DataFrame:
      D   B    A      C
0   dog  15  3.5   True
1   cat  10  4.1  False
2  bird   5  2.9   True

Axis 1 index sorted DataFrame:
     A   B      C     D
0  3.5  15   True   dog
1  4.1  10  False   cat
2  2.9   5   True  bird

In [1049]:
# sort_values()

# Create a DataFrame
data = {'Category': ['B', 'A', 'C', 'A', 'B', 'C', 'A', 'C'],
        'Values': [30, 20, 40, 10, 12, 20, 30, 40]}

df = pd.DataFrame(data, index=[3, 2, 4, 1, 5, 7, 6, 8])

# Sorting a DataFrame by Values
# Sort by the 'Values' column
sorted_by_values = df.sort_values(by='Values')

print(sorted_by_values)

  Category  Values
1        A      10
5        B      12
7        C      20
2        A      20
6        A      30
3        B      30
4        C      40
8        C      40

In [1050]:
# Sorting by Multiple Columns

# Sort by 'Category' and then 'Values'
sorted_by_multiple = df.sort_values(by=['Category', 'Values'])

print(sorted_by_multiple)

  Category  Values
1        A      10
2        A      20
6        A      30
5        B      12
3        B      30
7        C      20
4        C      40
8        C      40

In [1051]:
# Sorting in Descending Order
# Sort by 'Values' in descending order
sorted_descending = df.sort_values(by='Values', ascending=False)

print(sorted_descending)

  Category  Values
4        C      40
8        C      40
6        A      30
3        B      30
7        C      20
2        A      20
5        B      12
1        A      10

In [1052]:
# Sorting with NaN Values
# Create a DataFrame with NaN values
data_with_nan = {'Category': ['B', 'A', 'C', None],
                 'Values': [30, None, 40, 10]}

df_with_nan = pd.DataFrame(data_with_nan)

# Sort by 'Values' with NaN values placed first
sorted_nan_first = df_with_nan.sort_values(by='Values', na_position='first')

print(sorted_nan_first)

  Category  Values
1        A     NaN
3     None    10.0
0        B    30.0
2        C    40.0

### Concatenation

In [1141]:
# Function to make DF's
def make_df(cols, ind):
    """Quickly make a DataFrame"""
    data = {c: [str(c) + str(i) for i in ind]
            for c in cols}
    return pd.DataFrame(data, ind)

# example DataFrame
#make_df('ABC', range(3))

# Method to display Df's side by side
class display(object):
    """Display HTML representation of multiple objects"""
    template = """<div style="float: left; padding: 10px;">
    <p style='font-family:"Courier New", Courier, monospace'>{0}</p>{1}
    </div>"""
    def __init__(self, *args):
        self.args = args
        
    def _repr_html_(self):
        return '\n'.join(self.template.format(a, eval(a)._repr_html_())
                         for a in self.args)
    
    def __repr__(self):
        return '\n\n'.join(a + '\n' + repr(eval(a))
                           for a in self.args)

Pandas function, ``pd.concat()``, has a similar syntax to ``np.concatenate``

```python
pandas.concat(objs, *, axis=0, join='outer', ignore_index=False, keys=None, levels=None, names=None, verify_integrity=False, sort=False, copy=None)
```

In [1144]:
# concatinate 2 Series objects
ser1 = pd.Series(['A', 'B', 'C'], index=[1, 2, 3])

ser2 = pd.Series(['D', 'E', 'F'], index=[4, 5, 6])

pd.concat([ser1, ser2])

1    A
2    B
3    C
4    D
5    E
6    F
dtype: object

In [1150]:
# Concatenate 2 DF objects (default is axis=0, row-wise)
df1 = make_df('AB', [1, 2])

df2 = make_df('AB', [3, 4])

display('df1', 'df2', 'pd.concat([df1, df2])')

df1
    A   B
1  A1  B1
2  A2  B2

df2
    A   B
3  A3  B3
4  A4  B4

pd.concat([df1, df2])
    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

In [1146]:
# Specify column-wise concatenation
df3 = make_df('AB', [0, 1])

df4 = make_df('CD', [0, 1])

display('df3', 'df4', 'pd.concat([df3, df4], axis = 1)')

df3
    A   B
0  A0  B0
1  A1  B1

df4
    C   D
0  C0  D0
1  C1  D1

pd.concat([df3, df4], axis = 1)
    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1

In [1152]:
# od.concat preserves indices
x = make_df('AB', [0, 1])

y = make_df('AB', [2, 3])

y.index = x.index  # make duplicate indices

display('x', 'y', 'pd.concat([x, y])')

x
    A   B
0  A0  B0
1  A1  B1

y
    A   B
0  A2  B2
1  A3  B3

pd.concat([x, y])
    A   B
0  A0  B0
1  A1  B1
0  A2  B2
1  A3  B3

In [1154]:
# to catch repeat indices
# pd.concat([x, y], verify_integrity=True)

try:
    pd.concat([x, y], verify_integrity=True)
except ValueError as e:
    print("ValueError:", e)

ValueError: Indexes have overlapping values: Index([0, 1], dtype='int64')

In [1155]:
# ignore index (create new index)
display('x', 'y', 'pd.concat([x, y], ignore_index=True)')

x
    A   B
0  A0  B0
1  A1  B1

y
    A   B
0  A2  B2
1  A3  B3

pd.concat([x, y], ignore_index=True)
    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

In [1156]:
# adding MultiIndex
display('x', 'y', 'pd.concat([x, y], keys=["x", "y"])')

x
    A   B
0  A0  B0
1  A1  B1

y
    A   B
0  A2  B2
1  A3  B3

pd.concat([x, y], keys=["x", "y"])
      A   B
x 0  A0  B0
  1  A1  B1
y 0  A2  B2
  1  A3  B3

In [1157]:
# concatenation with joins (default is outer, ie: a union of two df's)
df5 = make_df('ABC', [1, 2])

df6 = make_df('BCD', [3, 4])

display('df5', 'df6', 'pd.concat([df5, df6])')

df5
    A   B   C
1  A1  B1  C1
2  A2  B2  C2

df6
    B   C   D
3  B3  C3  D3
4  B4  C4  D4

pd.concat([df5, df6])
     A   B   C    D
1   A1  B1  C1  NaN
2   A2  B2  C2  NaN
3  NaN  B3  C3   D3
4  NaN  B4  C4   D4

In [1158]:
# specify inner join (intersection of 2 df's)
display('df5', 'df6', 'pd.concat([df5, df6], join="inner")')

df5
    A   B   C
1  A1  B1  C1
2  A2  B2  C2

df6
    B   C   D
3  B3  C3  D3
4  B4  C4  D4

pd.concat([df5, df6], join="inner")
    B   C
1  B1  C1
2  B2  C2
3  B3  C3
4  B4  C4

### Merging

```python
DataFrame.merge(right, how='inner', on=None, left_on=None, right_on=None, left_index=False, right_index=False, sort=False, suffixes=('_x', '_y'), copy=None, indicator=False, validate=None)
```

In [1162]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'], 
                    'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})

df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'], 
                    'hire_date': [2004, 2008, 2012, 2014]})

display('df1', 'df2')

df1
  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

df2
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

In [1164]:
# One-to-One (detects merge on employee)
df3 = pd.merge(df1, df2)

df3

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [1165]:
df4 = pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR'],
                    'supervisor': ['Carly', 'Guido', 'Steve']})

# Many-to-One
display('df3', 'df4', 'pd.merge(df3, df4)')

df3
  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

df4
         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve

pd.merge(df3, df4)
  employee        group  hire_date supervisor
0      Bob   Accounting       2008      Carly
1     Jake  Engineering       2012      Guido
2     Lisa  Engineering       2004      Guido
3      Sue           HR       2014      Steve

In [1166]:
df5 = pd.DataFrame({'group': ['Accounting', 'Accounting', 
                              'Engineering', 'Engineering', 'HR', 'HR'],
                              'skills':['math', 'spreadsheets', 'coding', 'linux', 
                                        'spreadsheets', 'organization']})

# Many-to-Many
display('df1', 'df5', 'pd.merge(df1, df5)')

df1
  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

df5
         group        skills
0   Accounting          math
1   Accounting  spreadsheets
2  Engineering        coding
3  Engineering         linux
4           HR  spreadsheets
5           HR  organization

pd.merge(df1, df5)
  employee        group        skills
0      Bob   Accounting          math
1      Bob   Accounting  spreadsheets
2     Jake  Engineering        coding
3     Jake  Engineering         linux
4     Lisa  Engineering        coding
5     Lisa  Engineering         linux
6      Sue           HR  spreadsheets
7      Sue           HR  organization

In [1167]:
# specifying match key
display('df1', 'df2', 'pd.merge(df1, df2, on="employee")')

df1
  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

df2
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

pd.merge(df1, df2, on="employee")
  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [1172]:
df3 = pd.DataFrame({'name':['Bob', 'Jake', 'Lisa', 'Sue'],
                    'salary': [70000, 80000, 120000, 90000]})

# Specifying match keys with unique names (drop redundant column with drop)
display('df1', 'df3', 'pd.merge(df1, df3, left_on="employee", right_on="name").drop("name", axis=1)')

df1
  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

df3
   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000

pd.merge(df1, df3, left_on="employee", right_on="name").drop("name", axis=1)
  employee        group  salary
0      Bob   Accounting   70000
1     Jake  Engineering   80000
2     Lisa  Engineering  120000
3      Sue           HR   90000

In [1173]:
df1a = df1.set_index('employee')

df2a = df2.set_index('employee')

# merge on index 
display('df1a', 'df2a', 'pd.merge(df1a, df2a, left_index=True, right_index=True)')

df1a
                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR

df2a
          hire_date
employee
Lisa           2004
Bob            2008
Jake           2012
Sue            2014

pd.merge(df1a, df2a, left_index=True, right_index=True)
                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014

In [1174]:
# Join method defaults to indices
display('df1a', 'df2a', 'df1a.join(df2a)')

df1a
                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR

df2a
          hire_date
employee
Lisa           2004
Bob            2008
Jake           2012
Sue            2014

df1a.join(df2a)
                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014

In [1175]:
df6 = pd.DataFrame({'name': ['Peter', 'Paul', 'Mary'],
                    'food': ['fish', 'beans', 'bread']}, 
                    columns=['name', 'food'])

df7 = pd.DataFrame({'name': ['Mary', 'Joseph'], 
                    'drink': ['wine', 'beer']}, 
                    columns=['name', 'drink'])

# Merge DF (default method is inner, ie: intersection of two df's)
display('df6', 'df7', 'pd.merge(df6, df7)')

df6
    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread

df7
     name drink
0    Mary  wine
1  Joseph  beer

pd.merge(df6, df7)
   name   food drink
0  Mary  bread  wine

In [1177]:
# specify merge type (outer, similar to pd.concat() )
pd.merge(df6, df7, how='outer')

     name   food drink
0  Joseph    NaN  beer
1    Mary  bread  wine
2    Paul  beans   NaN
3   Peter   fish   NaN

The *left join* and *right join* return joins over the left entries and right entries, respectively.

In [1178]:
# left join (keep only entries that exist in left df)
display('df6', 'df7', 'pd.merge(df6, df7, how="left")')

df6
    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread

df7
     name drink
0    Mary  wine
1  Joseph  beer

pd.merge(df6, df7, how="left")
    name   food drink
0  Peter   fish   NaN
1   Paul  beans   NaN
2   Mary  bread  wine

In [1179]:
# right join (keep only entries that exist in right df)
display('df6', 'df7', 'pd.merge(df6, df7, how="right")')

df6
    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread

df7
     name drink
0    Mary  wine
1  Joseph  beer

pd.merge(df6, df7, how="right")
     name   food drink
0    Mary  bread  wine
1  Joseph    NaN  beer

In [1180]:
df8 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'], 
                    'rank': [1, 2, 3, 4]})

df9 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'], 
                    'rank': [3, 1, 4, 2]})

In [1182]:
# Conflicting column names
display('df8', 'df9', 'pd.merge(df8, df9, on="name")')

df8
   name  rank
0   Bob     1
1  Jake     2
2  Lisa     3
3   Sue     4

df9
   name  rank
0   Bob     3
1  Jake     1
2  Lisa     4
3   Sue     2

pd.merge(df8, df9, on="name")
   name  rank_x  rank_y
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2

In [1183]:
# Specify column suffix for conflicts
display('df8', 'df9', 'pd.merge(df8, df9, on="name", suffixes=["_L", "_R"])')

df8
   name  rank
0   Bob     1
1  Jake     2
2  Lisa     3
3   Sue     4

df9
   name  rank
0   Bob     3
1  Jake     1
2  Lisa     4
3   Sue     2

pd.merge(df8, df9, on="name", suffixes=["_L", "_R"])
   name  rank_L  rank_R
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2

Consider an example of some data about US states and their populations.
The data files can be found at http://github.com/jakevdp/data-USstates/:

Given this information, rank US states and territories by their 2010 population density.

In [1184]:
# # Following are shell commands to download the data
# !curl -O https://raw.githubusercontent.com/jakevdp/data-USstates/master/state-population.csv
# !curl -O https://raw.githubusercontent.com/jakevdp/data-USstates/master/state-areas.csv
# !curl -O https://raw.githubusercontent.com/jakevdp/data-USstates/master/state-abbrevs.csv

  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed

  0     0    0     0    0     0      0      0 --:--:-- --:--:-- --:--:--     0
 28 57935   28 16452    0     0  67889      0 --:--:-- --:--:-- --:--:-- 69417
100 57935  100 57935    0     0   227k      0 --:--:-- --:--:-- --:--:--  232k
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed

  0     0    0     0    0     0      0      0 --:--:-- --:--:-- --:--:--     0
100   835  100   835    0     0   2725      0 --:--:-- --:--:-- --:--:--  2774
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed

  0     0    0     0    0     0      0      0 --:--:-- --:--:-- --:--:--     0
100   872  100   872    0     0   4186      0 --:--:-- --:--:-- --:--:--  4295

In [1191]:
pop = pd.read_csv(r'C:\Users\Owner\Documents\GitHub\PythonDataScienceHandbook\notebooks_v1\data\state-population.csv')
areas = pd.read_csv(r'C:\Users\Owner\Documents\GitHub\PythonDataScienceHandbook\notebooks_v1\data\state-areas.csv')
abbrevs = pd.read_csv(r'C:\Users\Owner\Documents\GitHub\PythonDataScienceHandbook\notebooks_v1\data\state-abbrevs.csv')

display('pop.head()', 'areas.head()', 'abbrevs.head()')

pop.head()
  state/region     ages  year  population
0           AL  under18  2012   1117489.0
1           AL    total  2012   4817528.0
2           AL  under18  2010   1130966.0
3           AL    total  2010   4785570.0
4           AL  under18  2011   1125763.0

areas.head()
        state  area (sq. mi)
0     Alabama          52423
1      Alaska         656425
2     Arizona         114006
3    Arkansas          53182
4  California         163707

abbrevs.head()
        state abbreviation
0     Alabama           AL
1      Alaska           AK
2     Arizona           AZ
3    Arkansas           AR
4  California           CA

In [1245]:
print("The areas df has", areas.shape[0], "entries")

print("The abbrevs df has", abbrevs.shape[0], "entries")

# Join areas and abbrevs df's (outer join to preserve data)
state_areas = pd.merge(areas, abbrevs, how="outer")

state_areas.head()

The areas df has 52 entries
The abbrevs df has 51 entries

        state  area (sq. mi) abbreviation
0     Alabama          52423           AL
1      Alaska         656425           AK
2     Arizona         114006           AZ
3    Arkansas          53182           AR
4  California         163707           CA

In [1248]:
# check for mismatches
state_areas.isnull().any()

# inspect mismatch
state_areas[state_areas["abbreviation"].isnull()]

state            False
area (sq. mi)    False
abbreviation      True
dtype: bool

          state  area (sq. mi) abbreviation
39  Puerto Rico           3515          NaN

In [1252]:
# Fill in missing abbreviation
state_areas.loc[state_areas["state"] == "Puerto Rico", "abbreviation"] = "PR"

state_areas[state_areas["state"] == "Puerto Rico"]

state_areas.isnull().any()

          state  area (sq. mi) abbreviation
39  Puerto Rico           3515           PR

state            False
area (sq. mi)    False
abbreviation     False
dtype: bool

In [1253]:
# join state_areas and pop df's (specify outer to prevent data discard)
states_specs = pd.merge(state_areas, pop, left_on="abbreviation", right_on="state/region").drop("state/region", axis=1)

states_specs.head()

     state  area (sq. mi) abbreviation     ages  year  population
0  Alabama          52423           AL  under18  2012   1117489.0
1  Alabama          52423           AL    total  2012   4817528.0
2  Alabama          52423           AL  under18  2010   1130966.0
3  Alabama          52423           AL    total  2010   4785570.0
4  Alabama          52423           AL  under18  2011   1125763.0

In [1267]:
# Check for nulls
states_specs.isnull().any()

states_specs[states_specs["population"].isnull()].head()

# Check number of states with missing population values
states_specs[states_specs["population"].isnull()]["state"].unique()

# Check number of years with missing population values
states_specs[states_specs["population"].isnull()][["state", "year"]].drop_duplicates()

print("It seems Puerto Rico had no population data collected between 1990 and 1999.\nFor this case, we will drop those years")

state            False
area (sq. mi)    False
abbreviation     False
ages             False
year             False
population        True
dtype: bool

            state  area (sq. mi) abbreviation     ages  year  population
1872  Puerto Rico           3515           PR  under18  1990         NaN
1873  Puerto Rico           3515           PR    total  1990         NaN
1874  Puerto Rico           3515           PR    total  1991         NaN
1875  Puerto Rico           3515           PR  under18  1991         NaN
1876  Puerto Rico           3515           PR    total  1993         NaN

array(['Puerto Rico'], dtype=object)

            state  year
1872  Puerto Rico  1990
1874  Puerto Rico  1991
1876  Puerto Rico  1993
1878  Puerto Rico  1992
1880  Puerto Rico  1994
1882  Puerto Rico  1995
1884  Puerto Rico  1996
1886  Puerto Rico  1998
1888  Puerto Rico  1997
1890  Puerto Rico  1999

It seems Puerto Rico had no population data collected between 1990 and 1999.
For this case, we will drop those years

In [1269]:
# Drop missing values
states_specs = states_specs.dropna()

states_specs.isnull().any()

state            False
area (sq. mi)    False
abbreviation     False
ages             False
year             False
population       False
dtype: bool

In [1270]:
# Create density columns
states_specs['density']= states_specs["population"] / states_specs["area (sq. mi)"]

states_specs.head()

     state  area (sq. mi) abbreviation     ages  year  population    density
0  Alabama          52423           AL  under18  2012   1117489.0  21.316769
1  Alabama          52423           AL    total  2012   4817528.0  91.897221
2  Alabama          52423           AL  under18  2010   1130966.0  21.573851
3  Alabama          52423           AL    total  2010   4785570.0  91.287603
4  Alabama          52423           AL  under18  2011   1125763.0  21.474601

In [1271]:
# Select year & total populations
ranks = states_specs[(states_specs["ages"] == "total") & (states_specs["year"] == 2010)].copy()

# Define rank basked on state densities
ranks["rank"] = ranks["density"].rank(ascending=False)

ranks.head()

# sort ranked df
ranks_sorted = ranks.sort_values(by='rank')

ranks_sorted.head()

ranks_sorted.tail()

,state,area (sq. mi),abbreviation,ages,year,population,density,rank
3,Alabama,52423,AL,total,2010,4785570.0,91.287603,27.0
91,Alaska,656425,AK,total,2010,713868.0,1.087509,52.0
101,Arizona,114006,AZ,total,2010,6408790.0,56.214497,35.0
189,Arkansas,53182,AR,total,2010,2922280.0,54.948667,36.0
197,California,163707,CA,total,2010,37333601.0,228.051342,13.0

,state,area (sq. mi),abbreviation,ages,year,population,density,rank
389,District of Columbia,68,DC,total,2010,605125.0,8898.897059,1.0
1914,Puerto Rico,3515,PR,total,2010,3721208.0,1058.665149,2.0
1445,New Jersey,8722,NJ,total,2010,8802707.0,1009.253268,3.0
1962,Rhode Island,1545,RI,total,2010,1052669.0,681.339159,4.0
293,Connecticut,5544,CT,total,2010,3579210.0,645.600649,5.0

,state,area (sq. mi),abbreviation,ages,year,population,density,rank
2058,South Dakota,77121,SD,total,2010,816211.0,10.583512,48.0
1637,North Dakota,70704,ND,total,2010,674344.0,9.537565,49.0
1253,Montana,147046,MT,total,2010,990527.0,6.736171,50.0
2453,Wyoming,97818,WY,total,2010,564222.0,5.768079,51.0
91,Alaska,656425,AK,total,2010,713868.0,1.087509,52.0

# Pivot Tables

# End

In [1053]:
# Replace spaces in notebook title with underscores
filename = Notebook_title.replace(" ", "_") + "_requirements.txt"

# Run the pip freeze command and save the output txt file
!pip freeze > $filename

In [1055]:
import session_info
session_info.show()

c:\Users\Owner\Documents\GitHub\PythonDataScienceHandbook\.venv\Lib\site-packages\session_info\main.py:213: UserWarning: The '__version__' attribute is deprecated and will be removed in MarkupSafe 3.1. Use feature detection, or `importlib.metadata.version("markupsafe")`, instead.
  mod_version = _find_version(mod.__version__)